
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Java虚拟机的纤程和计算续体 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="state_of_loom_part1.html" />
    
    
    <link rel="prev" href="【翻译】为什么现代的JVM分析器仍然偏爱安全点？.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    概述
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../cpp_coroutine/first.html">
            
                <a href="../cpp_coroutine/first.html">
            
                    
                    C++20协程入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../cpp_coroutine/async_scope.html">
            
                <a href="../cpp_coroutine/async_scope.html">
            
                    
                    async scope和通用回调转协程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../io_uring/io_uring.html">
            
                <a href="../io_uring/io_uring.html">
            
                    
                    io_uring介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../io_uring/io_uringAndMemory.html">
            
                <a href="../io_uring/io_uringAndMemory.html">
            
                    
                    io_uring,Memory以及Procator的Socket IO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="../reactive_lock.html">
            
                <a href="../reactive_lock.html">
            
                    
                    响应式的锁
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1" >
            
                <span>
            
                    
                    Loom
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.1.1" data-path="../loom/Spring的loom化改造.html">
            
                <a href="../loom/Spring的loom化改造.html">
            
                    
                    Spring的Loom化改造
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.2" data-path="../loom/为什么jvm需要有栈协程.html">
            
                <a href="../loom/为什么jvm需要有栈协程.html">
            
                    
                    为什么jvm需要有栈协程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.1.3" data-path="../loom/synchronized适配.html">
            
                <a href="../loom/synchronized适配.html">
            
                    
                    VitrualThread对于synchronized适配
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6.2" >
            
                <span>
            
                    
                    Panama
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.6.2.1" data-path="../panama/panama-tutorial-0.html">
            
                <a href="../panama/panama-tutorial-0.html">
            
                    
                    Panama教程-0-MethodHandle介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2.2" data-path="../panama/afterUnsafe.html">
            
                <a href="../panama/afterUnsafe.html">
            
                    
                    失去了Unsafe内存操作之后该何去何从
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6.2.3" data-path="../panama/Panama浅析.html">
            
                <a href="../panama/Panama浅析.html">
            
                    
                    Panama源码浅析
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">翻译</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="【翻译】为什么现代的JVM分析器仍然偏爱安全点？.html">
            
                <a href="【翻译】为什么现代的JVM分析器仍然偏爱安全点？.html">
            
                    
                    为什么现代的jvm仍然偏爱安全点
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.2" data-path="loom_fiber_continuation.html">
            
                <a href="loom_fiber_continuation.html">
            
                    
                    Java虚拟机的纤程和计算续体
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="state_of_loom_part1.html">
            
                <a href="state_of_loom_part1.html">
            
                    
                    State of Loom - Part 1
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="state_of_loom_part2.html">
            
                <a href="state_of_loom_part2.html">
            
                    
                    State of Loom - Part 2
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="../loom/loom的实现.html">
            
                <a href="../loom/loom的实现.html">
            
                    
                    loom的实现
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Java虚拟机的纤程和计算续体</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="project-loom-java&#x865A;&#x62DF;&#x673A;&#x7684;&#x7EA4;&#x7A0B;&#x548C;&#x8BA1;&#x7B97;&#x7EED;&#x4F53;">Project Loom: Java&#x865A;&#x62DF;&#x673A;&#x7684;&#x7EA4;&#x7A0B;&#x548C;&#x8BA1;&#x7B97;&#x7EED;&#x4F53;</h1>
<p>&#x8BD1;&#x8005;&#xFF1A;</p>
<p>&#x51E0;&#x4E2A;&#x91CD;&#x8981;&#x540D;&#x8BCD;&#x7684;&#x7FFB;&#x8BD1;</p>
<p> continuation&#xFF08;&#x8BA1;&#x7B97;&#x7EED;&#x4F53;&#xFF09;</p>
<p>scheduler&#xFF08;&#x8C03;&#x5EA6;&#x5668;&#xFF09;</p>
<p>delimited continuation&#xFF08;&#x5B9A;&#x754C;&#x7EED;&#x4F53;&#xFF09;</p>
<p>&#x539F;&#x6587;&#x90E8;&#x5206;&#x7531;&#x4E8E;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x542B;&#x6709;&#x4E00;&#x5B9A;&#x8BED;&#x4E49; &#x6545;&#x4E0B;&#x6587;&#x5BF9;&#x5E94;&#x90E8;&#x5206;&#x4E0D;&#x7FFB;&#x8BD1;</p>
<p><a href="https://cr.openjdk.java.net/~rpressler/loom/Loom-Proposal.html" target="_blank">Loom Proposal.md (java.net)</a></p>
<h2 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h2>
<p>Project Loom&#x7684;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x7F16;&#x5199;&#x3001;&#x8C03;&#x8BD5;&#x3001;&#x914D;&#x7F6E;&#x548C;&#x7EF4;&#x62A4;&#x5E76;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x5F53;&#x4ECA;&#x7684;&#x9700;&#x6C42;&#x3002;Java&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x63D0;&#x4F9B;&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x7136;&#x800C;&#x65B9;&#x4FBF;&#x7684;&#x5E76;&#x53D1;&#x7ED3;&#x6784;(&#x6487;&#x5F00;&#x7EBF;&#x7A0B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x95EE;&#x9898;)&#xFF0C;&#x5B83;&#x6B63;&#x88AB;&#x4E0D;&#x592A;&#x65B9;&#x4FBF;&#x7684;&#x62BD;&#x8C61;&#x6240;&#x53D6;&#x4EE3;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x8FC7;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x6EE1;&#x8DB3;&#x5F53;&#x4E0B;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x6D6A;&#x8D39;&#x4E86;&#x5728;&#x4E91;&#x8BA1;&#x7B97;&#x4E2D;&#x7279;&#x522B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;Project Loom&#x5C06;&#x5F15;&#x5165;&#x7EA4;&#x7A0B;&#x4F5C;&#x4E3A;&#x7531;Java&#x865A;&#x62DF;&#x673A;&#x7BA1;&#x7406;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x3001;&#x9AD8;&#x6548;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4F46;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x548C;&#x66F4;&#x4F4E;&#x7684;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#x3002;&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x5E76;&#x53D1;&#x518D;&#x6B21;&#x53D8;&#x5F97;&#x7B80;&#x5355;!&#x7EA4;&#x7A0B;&#x7531;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x2014;&#x2014;continuation&#xFF08;&#x8BA1;&#x7B97;&#x7EED;&#x4F53;&#xFF09;&#x548C;scheduler&#xFF08;&#x8C03;&#x5EA6;&#x5668;&#xFF09;&#x3002;&#x7531;&#x4E8E;lava&#x5DF2;&#x7ECF;&#x6709;&#x4E86;<code>ForkJoinPool</code>&#x5F62;&#x5F0F;&#x7684;&#x4F18;&#x79C0;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x7EA4;&#x7A0B;&#x5C06;&#x901A;&#x8FC7;&#x5411;IVM&#x6DFB;&#x52A0;continuation&#x6765;&#x5B9E;&#x73B0;</p>
<h2 id="&#x52A8;&#x673A;">&#x52A8;&#x673A;</h2>
<p>&#x8BB8;&#x591A;&#x4E3A;Java&#x865A;&#x62DF;&#x673A;&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x5E76;&#x53D1;&#x7684;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x50CF;&#x670D;&#x52A1;&#x5668;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8FD9;&#x6837;&#x7684;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x670D;&#x52A1;&#x4E8E;&#x8BB8;&#x591A;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x53D1;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x5E76;&#x7ADE;&#x4E89;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;Project Loom&#x65E8;&#x5728;&#x663E;&#x8457;&#x964D;&#x4F4E;&#x7F16;&#x5199;&#x9AD8;&#x6548;&#x5E76;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x6D88;&#x9664;&#x7F16;&#x5199;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x65F6;&#x5BF9;&#x7B80;&#x5355;&#x6027;&#x548C;&#x6548;&#x7387;&#x4E4B;&#x95F4;&#x7684;&#x6743;&#x8861;&#x96BE;&#x5EA6;&#x3002;</p>
<p>&#x4E8C;&#x5341;&#x591A;&#x5E74;&#x524D;&#xFF0C;&#x5F53;Java&#x9996;&#x6B21;&#x53D1;&#x5E03;&#x65F6;&#xFF0C;&#x5B83;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8D21;&#x732E;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x65B9;&#x4FBF;&#x5730;&#x8BBF;&#x95EE;&#x7EBF;&#x7A0B;&#x548C;&#x540C;&#x6B65;&#x539F;&#x8BED;&#x3002;Java&#x7EBF;&#x7A0B;(&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x6216;&#x95F4;&#x63A5;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;Java servlet&#x5904;&#x7406;HTTP&#x8BF7;&#x6C42;)&#x4E3A;&#x7F16;&#x5199;&#x5E76;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x76EE;&#x524D;&#x7F16;&#x5199;&#x6EE1;&#x8DB3;&#x5F53;&#x4ECA;&#x9700;&#x6C42;&#x7684;&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x8981;&#x56F0;&#x96BE;&#x4E4B;&#x4E00;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x8F6F;&#x4EF6;&#x5E76;&#x53D1;&#x5355;&#x5143;(&#x7EBF;&#x7A0B;)&#x4E0D;&#x80FD;&#x4E0E;&#x4E1A;&#x52A1;&#x9886;&#x57DF;&#x7684;&#x5E76;&#x53D1;&#x5355;&#x5143;(&#x65E0;&#x8BBA;&#x662F;&#x7528;&#x6237;&#x3001;&#x4E8B;&#x52A1;&#x8FD8;&#x662F;&#x5355;&#x4E2A;&#x64CD;&#x4F5C;)&#x7684;&#x89C4;&#x6A21;&#x76F8;&#x5339;&#x914D;&#x3002;&#x5373;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E76;&#x53D1;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x5355;&#x4F4D;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x4F1A;&#x8BDD;,&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x8FDE;&#x63A5;,&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x5E76;&#x53D1;&#x6253;&#x5F00;&#x7684;&#x5957;&#x63A5;&#x5B57;,&#x7136;&#x800C;Java&#x8FD0;&#x884C;&#x65F6;&#x63D0;&#x4F9B;&#x7684;&#x5219;&#x662F;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;Java&#x7EBF;&#x7A0B;,&#x5B83;&#x4E0D;&#x80FD;&#x6709;&#x6548;&#x5730;&#x5904;&#x7406;&#x8D85;&#x8FC7;&#x51E0;&#x5343;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x8FD9;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x4E0D;&#x5339;&#x914D;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x88AB;&#x8FEB;&#x9009;&#x62E9;&#x662F;&#x628A;&#x9886;&#x57DF;&#x5E76;&#x53D1;&#x5355;&#x5143;&#x76F4;&#x63A5;&#x5EFA;&#x6A21;&#x4E3A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x5728;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x635F;&#x5931;&#x6781;&#x5927;&#x7684;&#x5E76;&#x53D1;&#x89C4;&#x6A21;&#xFF0C;&#x8FD8;&#x662F;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7ED3;&#x6784;&#x5728;&#x6BD4;&#x7EBF;&#x7A0B;(&#x4EFB;&#x52A1;)&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x7EA7;&#x522B;&#x4E0A;&#x5B9E;&#x73B0;&#x5E76;&#x53D1;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x4E0D;&#x963B;&#x585E;&#x8FD0;&#x884C;&#x7EBF;&#x7A0B;&#x7684;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x6765;&#x652F;&#x6301;&#x5E76;&#x53D1;&#x3002;</p>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;Java&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x5F15;&#x5165;&#x4E86;&#x8BB8;&#x591A;&#x5F02;&#x6B65;api&#xFF0C;&#x4ECE;JDK&#x4E2D;&#x7684;&#x5F02;&#x6B65;NIO&#x3001;&#x5F02;&#x6B65;servlet&#x548C;&#x8BB8;&#x591A;&#x5F02;&#x6B65;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x3002;&#x8FD9;&#x4E9B;api&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x7F16;&#x5199;&#x548C;&#x7406;&#x89E3;&#xFF0C;&#x751A;&#x81F3;&#x5B83;&#x4EEC;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x96BE;;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x8C03;&#x8BD5;&#x6216;&#x5206;&#x6790;&#x2014;&#x2014;&#x751A;&#x81F3;&#x4F1A;&#x66F4;&#x56F0;&#x96BE;(&#x5B83;&#x4EEC;&#x751A;&#x81F3;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x5806;&#x6808;&#x8DDF;&#x8E2A;);&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x5408;&#x6BD4;&#x540C;&#x6B65;&#x7684;api&#x597D;&#x2014;&#x2014;&#x4ED6;&#x4EEC;&#x7684;&#x7ED3;&#x5408;&#x4E0D;&#x90A3;&#x4E48;&#x4F18;&#x96C5;;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x66F4;&#x9002;&#x5408;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#xFF0C;&#x6216;&#x8005;&#x4E0E;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x96C6;&#x6210;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x5E76;&#x884C;&#x6027;&#x7684;&#x8F6F;&#x4EF6;&#x5355;&#x5143;&#x2014;&#x2014;&#x7EBF;&#x7A0B;&#x2014;&#x2014;&#x7684;&#x5B9E;&#x73B0;&#x4ECE;&#x5185;&#x5B58;&#x548C;&#x6027;&#x80FD;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x62BD;&#x8C61;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x3001;&#x81EA;&#x7136;&#x7684;&#x62BD;&#x8C61;&#x88AB;&#x629B;&#x5F03;&#xFF0C;&#x800C;&#x503E;&#x5411;&#x4E8E;&#x4E00;&#x4E2A;&#x4E0D;&#x90A3;&#x4E48;&#x81EA;&#x7136;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x60B2;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x867D;&#x7136;&#x4F7F;&#x7528;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x4F5C;&#x4E3A;Java&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x6709;&#x4E00;&#x4E9B;&#x4F18;&#x70B9;&#x2014;&#x2014;&#x6700;&#x663E;&#x8457;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6240;&#x6709;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x90FD;&#x7531;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x652F;&#x6301;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684;Java&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x672C;&#x5730;api&#x2014;&#x2014;&#x4F46;&#x662F;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x7F3A;&#x70B9;&#x592A;&#x5927;&#x4E86;&#x4EE5;&#x81F3;&#x4E8E;&#x4E0D;&#x5BB9;&#x5FFD;&#x89C6;&#xFF0C;&#x7ED3;&#x679C;&#x8981;&#x4E48;&#x662F;&#x96BE;&#x4EE5;&#x7F16;&#x5199;&#x3001;&#x7EF4;&#x62A4;&#x4EE3;&#x4EF7;&#x6602;&#x8D35;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x4E25;&#x91CD;&#x6D6A;&#x8D39;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x4EF7;&#x5728;&#x4EE3;&#x7801;&#x5728;&#x4E91;&#x5E73;&#x53F0;&#x4E2D;&#x8FD0;&#x884C;&#x65F6;&#x5C24;&#x5176;&#x6602;&#x8D35;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x8BED;&#x8A00;&#x548C;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;&#x6210;&#x529F;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#xFF0C;&#x6700;&#x8457;&#x540D;&#x7684;&#x662F;Erlang&#x548C;Go&#xFF0C;&#x8BE5;&#x7279;&#x6027;&#x975E;&#x5E38;&#x6709;&#x7528;&#x548C;&#x6D41;&#x884C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x7EA4;&#x7A0B;&#xFF0C;&#x7531;Java&#x8FD0;&#x884C;&#x65F6;&#x7BA1;&#x7406;&#xFF0C;&#x5B83;&#x5C06;&#x53EF;&#x9009;&#x5730;&#x4E0E;&#x73B0;&#x6709;&#x7684;&#x91CD;&#x91CF;&#x7EA7;&#x3001;os&#x63D0;&#x4F9B;&#x7684;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x7EA4;&#x7A0B;&#x5728;&#x5185;&#x5B58;&#x5360;&#x7528;&#x65B9;&#x9762;&#x6BD4;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x8F7B;&#x5F97;&#x591A;&#xFF0C;&#x5B83;&#x4EEC;&#xFF08;&#x8BD1;&#x8005;&#xFF1A;&#x6307;&#x7EA4;&#x7A0B;&#x4E4B;&#x95F4;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x52A1;&#x5207;&#x6362;&#x5F00;&#x9500;&#x63A5;&#x8FD1;&#x4E8E;&#x96F6;&#x3002;&#x5728;&#x5355;&#x4E2A;JVM&#x5B9E;&#x4F8B;&#x4E2D;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x6570;&#x767E;&#x4E07;&#x4E2A;&#x7EA4;&#x7A0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x65E0;&#x9700;&#x8003;&#x8651;&#x8FC7;&#x591A;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x51FA;&#x540C;&#x6B65;&#x7684;&#x963B;&#x585E;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x963B;&#x585E;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8F7B;&#x91CF;&#x7684;&#x3002;&#x9664;&#x4E86;&#x4F7F;&#x5E76;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x7B80;&#x5355;&#x6216;&#x66F4;&#x5177;&#x6709;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x4E4B;&#x5916;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x5E93;&#x4F5C;&#x8005;&#x7684;&#x5DE5;&#x4F5C;&#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x7B80;&#x6D01;&#x6027;/&#x6027;&#x80FD;&#x6743;&#x8861;&#x800C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x540C;&#x6B65;&#x548C;&#x5F02;&#x6B65;api&#x3002;&#x7B80;&#x6D01;&#x6027;&#x5C06;&#x662F;&#x6CA1;&#x6709;&#x4EE3;&#x4EF7;&#x7684;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x7EBF;&#x7A0B;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x662F;&#x4E24;&#x4E2A;&#x5173;&#x6CE8;&#x70B9;&#x7684;&#x7EC4;&#x5408;&#x2014;&#x2014;scheduler&#x548C;<em>continuation</em>&#x3002;&#x6211;&#x4EEC;&#x76EE;&#x524D;&#x7684;&#x610F;&#x56FE;&#x662F;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x5206;&#x5F00;,&#x5E76;&#x5B9E;&#x73B0;Java&#x7EA4;&#x7A0B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8FD9;&#x4E24;&#x4E2A;&#x6784;&#x5EFA;&#x90E8;&#x5206;&#x800C;&#x4E14;,&#x5C3D;&#x7BA1;&#x7EA4;&#x7A0B;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x8981;&#x52A8;&#x673A;,&#x4E5F;&#x6DFB;&#x52A0;continuation&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x9762;&#x5BF9;&#x6240;&#x9762;&#x5411;&#x7684;&#x62BD;&#x8C61;,&#x4F5C;&#x4E3A;continuation&#x4E5F;&#x6709;&#x5176;&#x4ED6;&#x7528;&#x9014;(&#x4F8B;&#x5982; <a href="https://wiki.python.org/moin/Generators" target="_blank">Python&apos;s generators</a>)&#x3002;</p>
<h2 id="&#x76EE;&#x6807;&#x548C;&#x8303;&#x56F4;">&#x76EE;&#x6807;&#x548C;&#x8303;&#x56F4;</h2>
<p>&#x7EA4;&#x7A0B;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x4F4E;&#x7EA7;&#x7684;&#x539F;&#x8BED;&#xFF0C;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6709;&#x8DA3;&#x7684;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#xFF0C;&#x6BD4;&#x5982;channel&#x3001;actor&#x548C;dataflow&#xFF0C;&#x4F46;&#x662F;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x7528;&#x9014;&#x5C06;&#x88AB;&#x8003;&#x8651;&#x5728;&#x5185;&#xFF0C;&#x4F46;&#x662F;&#x8BBE;&#x8BA1;&#x4EFB;&#x4F55;&#x90A3;&#x4E9B;&#x9AD8;&#x7EA7;&#x7684;&#x7ED3;&#x6784;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4E5F;&#x4E0D;&#x5EFA;&#x8BAE;&#x65B0;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x6216;&#x7EA4;&#x7A0B;&#x4E4B;&#x95F4;&#x90A3;&#x4E9B;&#x63A8;&#x8350;&#x7684;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x6A21;&#x5F0F;(&#x4F8B;&#x5982;&#xFF0C;&#x5171;&#x4EAB;&#x5185;&#x5B58;vs.&#x6D88;&#x606F;&#x4F20;&#x9012;)&#x3002;&#x7531;&#x4E8E;&#x9650;&#x5236;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x662F;&#x5176;&#x4ED6;OpenJDK&#x9879;&#x76EE;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65E0;&#x8BBA;&#x662F;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#x8FD8;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x90FD;&#x9002;&#x7528;&#x4E8E;&#x7EBF;&#x7A0B;&#x62BD;&#x8C61;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x9879;&#x76EE;&#x53D1;&#x751F;&#x4EA4;&#x53C9;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5411;Java&#x5E73;&#x53F0;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#x7ED3;&#x6784;&#x2014;&#x2014;&#x7EA4;&#x7A0B;&#x3002;&#x4E0B;&#x9762;&#x5C06;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x7684;&#x9762;&#x5411;&#x7528;&#x6237;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x5176;&#x76EE;&#x6807;&#x662F;&#x5141;&#x8BB8;<em>&#x5927;&#x591A;&#x6570;</em> Java&#x4EE3;&#x7801;(&#x610F;&#x601D;&#x662F;Java&#x7C7B;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x7528;Java&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;)&#x5728;&#x7EA4;&#x7A0B;&#x5185;&#x4E0D;&#x52A0;&#x4FEE;&#x6539;&#x5730;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x505A;&#x6700;&#x5C0F;&#x7684;&#x4FEE;&#x6539;&#x3002;&#x5141;&#x8BB8;&#x4ECE;Java&#x4EE3;&#x7801;&#x8C03;&#x7528;&#x7684;&#x672C;&#x673A;&#x4EE3;&#x7801;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5C3D;&#x7BA1;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x4E5F;&#x4E0D;&#x662F;&#x786E;&#x4FDD;&#x6BCF;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x65F6;&#x90FD;&#x80FD;&#x83B7;&#x5F97;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x597D;&#x5904;;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E00;&#x4E9B;&#x4E0D;&#x592A;&#x9002;&#x5408;&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5411;Java&#x5E73;&#x53F0;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x516C;&#x5F00;&#x7684;delimited continuation(&#x6216; <em>coroutine</em>)&#x7ED3;&#x6784;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x6B21;&#x4E8E;&#x7EA4;&#x7A0B;(&#x7EA4;&#x7A0B;&#x9700;&#x8981;continuation&#xFF0C;&#x7A0D;&#x540E;&#x4F1A;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;continuation&#x4E0D;&#x4E00;&#x5B9A;&#x8981;&#x4F5C;&#x4E3A;&#x516C;&#x5171;API&#x516C;&#x5F00;)&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x9A8C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x4F46;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x4E25;&#x8083;&#x7684;&#x7814;&#x7A76;&#x8C03;&#x5EA6;&#x5668;&#x8BBE;&#x8BA1;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;<code>ForkJoinPool</code>&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7684;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x3002;</p>
<p>&#x5411;JVM&#x6DFB;&#x52A0;&#x8C03;&#x7528;&#x5806;&#x6808;&#x7684;&#x64CD;&#x4F5C;&#x80FD;&#x529B;&#x65E0;&#x7591;&#x662F;&#x5FC5;&#x9700;&#x7684;,&#x4E5F;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x66F4;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7ED3;&#x6784;,&#x5141;&#x8BB8;&#x5728;&#x67D0;&#x4E9B;&#x70B9;&#x4E0A;&#x8FDB;&#x884C;&#x5806;&#x6808;&#x5C55;&#x5F00;,&#x7136;&#x540E;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x6CD5;(&#x4E00;&#x822C;&#x662F;&#x4E00;&#x4E2A;&#x6CDB;&#x7528;&#x7684;&#x6709;&#x6548;&#x5C3E;&#x8C03;&#x7528;)&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8BE5;&#x7279;&#x6027;&#x79F0;&#x4E3A;<em>unwind-and-invoke</em>&#xFF0C;&#x6216;UAI&#x3002;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x6807;&#x4E0D;&#x662F;&#x5411;JVM&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x81EA;&#x52A8;&#x7684;&#x5C3E;&#x8C03;&#x7528;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x53EF;&#x80FD;&#x4F1A;&#x6D89;&#x53CA;&#x5230;Java&#x5E73;&#x53F0;&#x7684;&#x4E0D;&#x540C;&#x7EC4;&#x4EF6;&#xFF0C;&#x5176;&#x7279;&#x6027;&#x662F;&#x8FD9;&#x6837;&#x5212;&#x5206;&#x7684;:</p>
<ul>
<li>&#x5728;JVM&#x5185;&#x90E8;&#x5B9E;&#x73B0;Continuation&#x548C;UAI&#xFF0C;&#x5E76;&#x4E14;&#x66B4;&#x9732;&#x4E3A;&#x7B80;&#x6D01;&#x7684;Java API</li>
<li>&#x7EA4;&#x7A0B;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5728;JDK&#x7684;java&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x9700;&#x8981;JVM&#x7684;&#x5E2E;&#x52A9;</li>
<li>JDK&#x5E93;&#x4E2D;&#x4F7F;&#x7528;&#x4F1A;&#x963B;&#x585E;&#x7EBF;&#x7A0B;&#x7684;&#x672C;&#x5730;&#x4EE3;&#x7801;&#xFF08;native code&#xFF09;&#x4F1A;&#x88AB;&#x9002;&#x914D;&#x4E3A;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x7EA4;&#x7A0B;&#x4E0A;&#x7684;&#x7248;&#x672C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x66F4;&#x6539;<code>java.io</code>&#x7684;&#x7C7B;</li>
<li>JDK&#x5E93;&#x4E2D;&#x662F;&#x4F7F;&#x7528;&#x4F4E;&#x5C42;&#x6B21;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#xFF08;&#x7279;&#x522B;&#x662F;<code>LockSupport</code>&#x7C7B;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;<code>java.util.concurrent</code>&#x5C06;&#x88AB;&#x9002;&#x914D;&#x4E3A;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x7EA4;&#x7A0B;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x53D6;&#x51B3;&#x4E8E;&#x7EA4;&#x7A0B;API&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x4EFB;&#x610F;&#x60C5;&#x51B5;&#x4E0B;&#x5DE5;&#x4F5C;&#x91CF;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x5C0F;&#xFF08;&#x56E0;&#x4E3A;&#x7EA4;&#x7A0B;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x7684;API&#x548C;&#x7EBF;&#x7A0B;&#x5F88;&#x76F8;&#x4F3C;&#xFF09;</li>
<li>&#x8C03;&#x8BD5;&#x5668;&#xFF0C;&#x5206;&#x6790;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x6027;&#x670D;&#x52A1;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7EA4;&#x7A0B;&#x7684;&#x5B58;&#x5728;&#x4EE5;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;JFR&#x548C;JVMTI&#x5C06;&#x9700;&#x8981;&#x9002;&#x5E94;&#x7EA4;&#x7A0B;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x6DFB;&#x52A0;&#x76F8;&#x5173;&#x7684;&#x5E73;&#x53F0;MBean</li>
<li>&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x9884;&#x89C1;&#x5230;&#x5BF9;Java&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x7684;&#x9700;&#x8981;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x8FD8;&#x5904;&#x4E8E;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5207;&#x2014;&#x2014;&#x5305;&#x62EC;&#x5B83;&#x7684;&#x8303;&#x56F4;&#x2014;&#x2014;&#x90FD;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x53D8;&#x5316;</p>
<h2 id="&#x672F;&#x8BED;">&#x672F;&#x8BED;</h2>
<p>&#x7531;&#x4E8E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x548C;&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#x53EA;&#x662F;&#x540C;&#x4E00;&#x62BD;&#x8C61;&#x7684;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x7136;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x672F;&#x8BED;&#x4E0A;&#x7684;&#x6DF7;&#x6DC6;&#x3002;&#x672C;&#x6587;&#x5C06;&#x91C7;&#x7528;&#x4EE5;&#x4E0B;&#x7EA6;&#x5B9A;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x6B21;&#x901A;&#x4FE1;&#xFF08;correspondence&#xFF09;&#x90FD;&#x5E94;&#x9075;&#x5FAA;&#x4EE5;&#x4E0B;&#x7EA6;&#x5B9A;:</p>
<ul>
<li>&#x5355;&#x8BCD;<em>thread</em>&#x53EA;&#x6307;&#x62BD;&#x8C61;(&#x7A0D;&#x540E;&#x5C06;&#x8BA8;&#x8BBA;)&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;<em>thread</em>&#x53EF;&#x4EE5;&#x6307;&#x62BD;&#x8C61;&#x7684;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FD8;&#x662F;&#x8FD0;&#x884C;&#x65F6;&#x5B8C;&#x6210;&#x3002;</li>
<li>&#x5F53;&#x63D0;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x672F;&#x8BED;<em>&#x91CD;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;</em>&#x3001;<em>&#x5185;&#x6838;&#x7EBF;&#x7A0B;</em>&#x548C;<em>OS&#x7EBF;&#x7A0B;</em>&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#x5730;&#x7528;&#x6765;&#x8868;&#x793A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x63D0;&#x4F9B;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x672F;&#x8BED;<em>&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;</em>&#x3001;<em>&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x7EBF;&#x7A0B;</em>&#x548C;<em>&#x7EA4;&#x7A0B;</em>&#x53EF;&#x4EE5;&#x4E92;&#x6362;&#x5730;&#x7528;&#x6765;&#x8868;&#x793A;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;(Java&#x5E73;&#x53F0;&#x4E2D;&#x7684;JVM&#x548C;JDK&#x5E93;)&#x63D0;&#x4F9B;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x4E9B;&#x8BCD;<em>&#x5E76;&#x4E0D;</em>&#x6307;&#x7684;&#x662F;&#x7279;&#x5B9A;&#x7684;Java&#x7C7B;(&#x81F3;&#x5C11;&#x5728;&#x8FD9;&#x4E9B;API&#x8BBE;&#x8BA1;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x65E9;&#x671F;&#x9636;&#x6BB5;)</li>
<li>&#x5927;&#x5199;&#x7684;&#x201C;Thread&#x201D;&#x548C;&#x201C;Fiber&#x201D;&#x6307;&#x7684;&#x662F;&#x7279;&#x5B9A;&#x7684;Java&#x7C7B;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x8BA8;&#x8BBA;API&#x7684;&#x8BBE;&#x8BA1;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
<h2 id="&#x7EBF;&#x7A0B;&#x662F;&#x4EC0;&#x4E48;">&#x7EBF;&#x7A0B;&#x662F;&#x4EC0;&#x4E48;</h2>
<p>&#x7EBF;&#x7A0B;&#xFF08;thread&#xFF09;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;,&#x5176;&#x4E0D;&#x4EC5;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x8BA1;&#x7B97;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x53EF;&#x80FD;&#x5B58;&#x5728;IO&#x64CD;&#x4F5C;,&#x6682;&#x505C;,&#x548C;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x2014;&#x2014;&#x4E00;&#x822C;&#x6765;&#x8BF4;,&#x6307;&#x4EE4;&#x5BFC;&#x81F4;&#x7684;&#x8BA1;&#x7B97;&#x7B49;&#x5F85;&#x4E00;&#x4E9B;&#x5916;&#x90E8;&#x4E8B;&#x4EF6;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;,&#x6709;&#x80FD;&#x529B;<em>&#x6682;&#x505C;</em>&#x672C;&#x8EAB;,&#x548C;&#x81EA;&#x52A8;&#x7B49;&#x5F85;&#x7684;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x6062;&#x590D;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#x65F6;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x8BA9;&#x51FA;CPU&#x6838;&#x5FC3;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7531;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#x63D0;&#x4F9B;&#x3002;&#x4E00;&#x4E2A;<em>continuation</em>&#x662F;&#x4E00;&#x4E2A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x6307;&#x4EE4;&#x5E8F;&#x5217;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x6682;&#x505C;&#x81EA;&#x8EAB;(&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x5904;&#x7406;&#x5C06;&#x5728;&#x540E;&#x9762;&#x7684;<a href="https://cr.openjdk.java.net/~rpressler/loom/Loom-Proposal.html#header-n135" target="_blank">continuations</a>&#x5C0F;&#x8282;&#x4E2D;&#x7ED9;&#x51FA;)&#x3002;scheduler&#xFF08;&#x8C03;&#x5EA6;&#x5668;&#xFF09;&#x5C06;continuation&#x5206;&#x914D;&#x7ED9;CPU&#x5185;&#x6838;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x51C6;&#x5907;&#x8FD0;&#x884C;&#x7684;continuation&#x66FF;&#x6362;&#x4E00;&#x4E2A;&#x6682;&#x505C;&#x7684;continuation&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x51C6;&#x5907;&#x6062;&#x590D;&#x7684;continuation&#x6700;&#x7EC8;&#x5C06;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x4E00;&#x4E2A;CPU&#x5185;&#x6838;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x7ED3;&#x6784;:continuation&#x548C;scheduler&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E24;&#x4E2A;&#x4E0D;&#x4E00;&#x5B9A;&#x5355;&#x72EC;&#x4F5C;&#x4E3A;api&#x516C;&#x5F00;&#x3002;</p>
<p>&#x540C;&#x6837;&#xFF0C;&#x7EBF;&#x7A0B;&#xFF08;thread&#xFF09;(&#x81F3;&#x5C11;&#x5728;&#x8FD9;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;)&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x672C;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x7F16;&#x7A0B;&#x8303;&#x5F0F;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x6307;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x5199;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x548C;&#x6682;&#x505C;&#x7684;&#x4EE3;&#x7801;&#x5E8F;&#x5217;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#x7684;&#x4EFB;&#x4F55;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x6216;&#x4F20;&#x9012;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6709;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5173;&#x6CE8;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x4E2A;&#x9009;&#x62E9;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x76EE;&#x524D;&#xFF0C;Java&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;&#x7EBF;&#x7A0B;&#x7ED3;&#x6784;&#x662F;<code>Thread</code>&#x7C7B;&#xFF0C;&#x5B83;&#x662F;&#x7531;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;OS&#x6765;&#x5B9E;&#x73B0;continuation&#x548C;scheduler&#x3002;</p>
<p>Java&#x5E73;&#x53F0;&#x516C;&#x5F00;&#x7684;continuation&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x4E0E;&#x73B0;&#x6709;&#x7684;Java  scheduler(&#x5982;<code>ForkJoinPool</code>&#x3001;<code>ThreadPoolExecutor</code>&#x6216;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x5B9E;&#x73B0;)&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x6216;&#x8005;&#x4E0E;&#x4E13;&#x95E8;&#x4E3A;&#x6B64;&#x76EE;&#x7684;&#x4F18;&#x5316;&#x7684;scheduler&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x7EA4;&#x7A0B;&#x3002;</p>
<p>&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x62C6;&#x5206;&#x8FD9;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x6784;&#x5EFA;&#x5757;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;Google(<a href="https://www.youtube.com/watch?v=KXuZi9aeGTw" target="_blank">video</a>&#xFF0C; <a href="http://www.linuxplumbersconf.org/2013/ocw/system/presentations/1653/original/LPC - User Threading.pdf" target="_blank">slides</a>)&#x4E2D;&#x5BF9;Linux&#x5185;&#x6838;&#x6240;&#x505A;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6001;&#x4EE3;&#x7801;&#x63A5;&#x7BA1;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x8C03;&#x5EA6;&#xFF0C;&#x56E0;&#x6B64;&#x57FA;&#x672C;&#x4E0A;&#x4F9D;&#x8D56;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6765;&#x5B9E;&#x73B0;continuation&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5E93;&#x6765;&#x5904;&#x7406;&#x8C03;&#x5EA6;&#x3002;&#x8FD9;&#x5177;&#x6709;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x8C03;&#x5EA6;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x540C;&#x65F6;&#x4ECD;&#x7136;&#x5141;&#x8BB8;&#x672C;&#x5730;&#x4EE3;&#x7801;&#x5728;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x76F8;&#x5BF9;&#x8F83;&#x9AD8;&#x7684;&#x5185;&#x5B58;&#x5360;&#x7528;&#x548C;&#x4E0D;&#x80FD;&#x8C03;&#x6574;&#x5806;&#x6808;&#x5927;&#x5C0F;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x800C;&#x4E14;&#x76EE;&#x524D;&#x8FD8;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x4EE5;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5206;&#x5272;&#x5B9E;&#x73B0;&#x2014;&#x2014;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x8C03;&#x5EA6;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x63D0;&#x4F9B;continuation&#x2014;&#x2014;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x597D;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7ED3;&#x5408;&#x4E86;&#x4E24;&#x4E2A;&#x4E16;&#x754C;&#x7684;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;&#x6237;&#x6A21;&#x5F0F;&#x7EBF;&#x7A0B;&#x4F1A;&#x6BD4;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x66F4;&#x597D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4EEC;&#x503C;&#x5F97;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x8F7B;&#x91CF;&#x7EA7;&#x201D;?&#x540C;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x5206;&#x522B;&#x8003;&#x8651;continuation&#x548C;scheduler&#x8FD9;&#x4E24;&#x4E2A;&#x7EC4;&#x4EF6;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6302;&#x8D77;&#xFF08;suspend&#xFF09;&#x8BA1;&#x7B97;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;continuation&#x6765;&#x5B58;&#x50A8;&#x6574;&#x4E2A;&#x8C03;&#x7528;&#x5806;&#x6808;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x6216;&#x8005;&#x7B80;&#x5355;&#x5730;&#x5B58;&#x50A8;&#x5806;&#x6808;&#x3002;&#x4E3A;&#x4E86;&#x652F;&#x6301;&#x672C;&#x5730;&#x8BED;&#x8A00;&#xFF08;native language&#xFF09;&#xFF0C;&#x5B58;&#x50A8;&#x5806;&#x6808;&#x7684;&#x5185;&#x5B58;&#x5FC5;&#x987B;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x5728;&#x76F8;&#x540C;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x3002;&#x867D;&#x7136;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x786E;&#x5B9E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4F46;&#x8FD9;&#x7C7B;&#x5185;&#x6838;continuation(&#x5373;&#x6808;)&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x548C;&#x7075;&#x6D3B;&#x6027;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x9650;&#x5236;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5806;&#x6808;&#x6839;&#x636E;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x589E;&#x957F;&#x548C;&#x6536;&#x7F29;&#x3002;&#x7531;&#x4E8E;&#x7EBF;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;&#x5B9E;&#x73B0;&#x4E0D;&#x9700;&#x8981;&#x652F;&#x6301;&#x4EFB;&#x610F;&#x672C;&#x673A;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5982;&#x4F55;&#x5B58;&#x50A8;continuation&#x65B9;&#x9762;&#x83B7;&#x5F97;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x66F4;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x8C03;&#x5EA6;&#x5668;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x5668;&#x5728;&#x5185;&#x6838;&#x6A21;&#x5F0F;&#x4E0B;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x5F53;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x548C;&#x5C06;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x5EA6;&#x5668;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x975E;&#x5EC9;&#x4EF7;&#x7684;&#x7528;&#x6237;/&#x5185;&#x6838;&#x5207;&#x6362;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x5668;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x5EA6;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#x7EBF;&#x7A0B;&#x3002;&#x4F46;&#x662F;&#x8FD0;&#x884C;&#x89C6;&#x9891;&#x7F16;&#x7801;&#x5668;&#x7684;&#x7EBF;&#x7A0B;&#x4E0E;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x8BF7;&#x6C42;&#x7684;&#x7EBF;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x540C;&#x6837;&#x7684;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#x5BF9;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x662F;&#x6700;&#x4F18;&#x7684;&#x3002;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5904;&#x7406;&#x4E8B;&#x52A1;&#x7684;&#x7EBF;&#x7A0B;&#x503E;&#x5411;&#x4E8E;&#x5448;&#x73B0;&#x7279;&#x5B9A;&#x7684;&#x884C;&#x4E3A;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x5BF9;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8C03;&#x5EA6;&#x5668;&#x6784;&#x6210;&#x4E86;&#x6311;&#x6218;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E8B;&#x52A1;&#x670D;&#x52A1;&#x7EBF;&#x7A0B;<code>A</code>&#x5BF9;&#x8BF7;&#x6C42;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6570;&#x636E;&#x4F20;&#x9012;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;<code>B</code>&#x8FDB;&#x884C;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x540C;&#x6B65;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x95F4;&#x7684;&#x5207;&#x6362;,&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x4E00;&#x4E2A;&#x9501;&#x6216;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x961F;&#x5217;,&#x4F46;&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x6837;&#x7684;:<code>A</code>&#x5BF9;&#x4E00;&#x4E9B;&#x6570;&#x636E;<code>x</code>&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;,&#x4EA4;&#x7ED9;<code>B</code>,&#x5524;&#x9192;<code>B</code>&#x7136;&#x540E;<code>A</code>&#x963B;&#x585E;&#x5230;&#x9700;&#x8981;&#x5904;&#x7406;&#x4ECE;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x975E;&#x5E38;&#x5E38;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5047;&#x8BBE;<code>A</code>&#x5728;&#x89E3;&#x9664;<code>B</code>&#x7684;&#x963B;&#x585E;&#x540E;&#x4E0D;&#x4E45;&#x5C31;&#x4F1A;&#x963B;&#x585E;&#xFF0C;&#x6240;&#x4EE5;&#x5C06;<code>B</code>&#x548C;<code>A</code>&#x5B89;&#x6392;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6838;&#x4E0A;&#x5C06;&#x662F;&#x6709;&#x76CA;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;<code>x</code>&#x5DF2;&#x7ECF;&#x5728;&#x6838;&#x7684;cache&#x4E2D;&#x4E86;;&#x6B64;&#x5916;&#xFF0C;&#x5411;CPU&#x6838;&#x5FC3;&#x672C;&#x5730;&#x961F;&#x5217;&#x6DFB;&#x52A0;<code>B</code>&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x4EE3;&#x4EF7;&#x9AD8;&#x6602;&#x7684;&#x7ADE;&#x4E89;&#x540C;&#x6B65;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x50CF;<code>ForkJoinPool</code>&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x7A83;&#x53D6;&#x8C03;&#x5EA6;&#x5668;&#x505A;&#x51FA;&#x4E86;&#x8FD9;&#x4E2A;&#x7CBE;&#x786E;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x628A;&#x4EFB;&#x52A1;&#x6DFB;&#x52A0;&#x5230;&#x672C;&#x5730;&#x961F;&#x5217;&#x8FDB;&#x884C;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5185;&#x6838;&#x4E0D;&#x80FD;&#x505A;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x4ECE;&#x5185;&#x6838;&#x7684;&#x9884;&#x6D4B;&#x6765;&#x770B;&#xFF0C;&#x7EBF;&#x7A0B;<code>A</code>&#x53EF;&#x80FD;&#x60F3;&#x8981;&#x5728;&#x5524;&#x9192;<code>B</code>&#x4E4B;&#x540E;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4F1A;&#x628A;&#x6700;&#x8FD1;&#x672A;&#x963B;&#x585E;<code>B</code>&#x8C03;&#x5EA6;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x6838;&#x5FC3;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x540C;&#x6B65;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;<code>B</code>&#x8BBF;&#x95EE;<code>x</code>&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;cache-fault(&#x8BD1;&#x8005;&#xFF1A;&#x7C7B;&#x4E8E;cache&#x7F3A;&#x5931;&#x5F15;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;)&#x3002;</p>
<h2 id="&#x7EA4;&#x7A0B;">&#x7EA4;&#x7A0B;</h2>
<p>&#x7EA4;&#x7A0B;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#x7684;Java&#x8BA1;&#x5212;&#x63D0;&#x4F9B;&#x7684;&#x7528;&#x6237;&#x6001;&#x7EBF;&#x7A0B;&#x3002;&#x672C;&#x8282;&#x5C06;&#x5217;&#x51FA;&#x7EA4;&#x7A0B;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x63A2;&#x8BA8;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x548C;&#x9009;&#x9879;&#x3002;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x8BE6;&#x5C3D;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x7684;&#x8F6E;&#x5ED3;&#xFF0C;&#x5E76;&#x6307;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>&#x5C31;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x800C;&#x8A00;&#xFF0C;&#x7EA4;&#x7A0B;&#x5FC5;&#x987B;&#x4E0E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;(&#x8F7B;&#x91CF;&#x7EA7;&#x6216;&#x91CD;&#x91CF;&#x7EA7;)&#x5E76;&#x53D1;&#x5730;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x4E00;&#x6BB5;Java&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x7B49;&#x5F85;&#x5B83;&#x4EEC;&#x7684;&#x505C;&#x6B62;&#xFF0C;&#x53C2;&#x4E0E;&#x4ED6;&#x4EEC;&#x7684;&#x534F;&#x4F5C;&#xFF08;join them&#xFF09;&#x3002;&#x663E;&#x7136;&#xFF0C;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E9B;&#x673A;&#x5236;&#x6765;&#x6302;&#x8D77;&#x548C;&#x6062;&#x590D;&#x7EA4;&#x7A0B;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;<code>LockSupport</code>&#x7684; <code>park</code> /<code>unpark</code>&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5E0C;&#x671B;&#x83B7;&#x5F97;&#x7EA4;&#x7A0B;&#x7684;&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#xFF0C;&#x4EE5;&#x4FBF;&#x76D1;&#x63A7;/&#x8C03;&#x8BD5;&#x4EE5;&#x53CA;&#x5B83;&#x7684;&#x72B6;&#x6001;(&#x6302;&#x8D77;/&#x8FD0;&#x884C;)&#x7B49;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x56E0;&#x4E3A;&#x7EA4;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5B83;&#x5C06;&#x62E5;&#x6709;&#x4E0E;&#x91CD;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;(&#x7531;&apos;<code>Thread</code>&#x7C7B;&#x8868;&#x793A;)&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684;API&#x3002;&#x5173;&#x4E8E;Java&#x5185;&#x5B58;&#x6A21;&#x578B;&#xFF0C;&#x7EA4;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x5C06;&#x5B8C;&#x5168;&#x50CF;&#x5F53;&#x524D;&#x7684; Thread &#x5B9E;&#x73B0;&#x3002;&#x867D;&#x7136;&#x7EA4;&#x7A0B;&#x5C06;&#x4F7F;&#x7528;jvm&#x7BA1;&#x7406;&#x7684;continuation&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5B83;&#x4EEC;&#x4E0E;OS&#x7684;continuation&#x517C;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;Google&#x7684;&#x7528;&#x6237;&#x6001;&#x8C03;&#x5EA6;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#x7EA4;&#x7A0B;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x72EC;&#x7279;&#x7684;&#x529F;&#x80FD;:&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x7EA4;&#x7A0B;&#x6709;&#x4E00;&#x4E2A;&#x53EF;&#x63D2;&#x62D4;&#x7684;&#x8C03;&#x5EA6;&#x8C03;&#x5EA6;&#x5668;(&#x56FA;&#x5B9A;&#x5728;&#x7EA4;&#x7A0B;&#x7684;&#x7ED3;&#x6784;,&#x6216;&#x8005;&#x5728;&#x5B83;&#x6682;&#x505C;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x88AB;&#x66F4;&#x6362;,&#x4F8B;&#x5982;&#x6709;&#x9700;&#x8981;&#x8C03;&#x5EA6;&#x5668;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;<code>unpark</code>&#x65B9;&#x6CD5;),&#x6211;&#x4EEC;&#x60F3;&#x8BA9;&#x7EA4;&#x7A0B;&#x662F;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x7684;(&#x8FD9;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7AE0;&#x8282;&#x8BA8;&#x8BBA;)&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7EA4;&#x7A0B;API&#x5C06;&#x4E0E;&#x201C;&#x7EBF;&#x7A0B;&#x201D;&#x7684;API&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x62BD;&#x8C61;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x5E0C;&#x671B;&#x5C06;&#x76EE;&#x524D;&#x5728;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C11;&#x91CF;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5C31;&#x80FD;&#x8FD0;&#x884C;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x3002;&#x8FD9;&#x7ACB;&#x5373;&#x63D0;&#x51FA;&#x4E86;&#x4E24;&#x79CD;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;:</p>
<ol>
<li>&#x5C06;&#x7EA4;&#x7A0B;&#x8868;&#x793A;&#x4E3A;<code>Fiber</code>&#x7C7B;&#xFF0C;&#x5E76;&#x5C06;<code>Fiber</code>&#x548C;<code>Thread</code>&#x7684;&#x901A;&#x7528;API&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x8D85;&#x7C7B;&#x578B;&#xFF0C;&#x6682;&#x65F6;&#x79F0;&#x4E3A;<code>Strand</code>&#x3002;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x77E5;&#x9053;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7684;&#x7EBF;&#x7A0B;( Thread-implementation-agnostic )&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x9488;&#x5BF9;<code>Strand</code>&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5728;&#x4E00;&#x4E2A;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;<code>Strand.currentStrand</code>&#x5C06;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7EA4;&#x7A0B;&#xFF0C;&#x800C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x4E2A;&#x7EA4;&#x7A0B;&#x4E2D;<code>Strand.sleep</code>&#x5C06;&#x6302;&#x8D77;&#x7EA4;&#x7A0B;</li>
<li>&#x4E3A;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;<code>Thread</code>&#x7C7B;&#x2014;&#x2014;&#x7528;&#x6237;&#x6001;&#x548C;&#x5185;&#x6838;&#x6001;&#x2014;&#x2014;&#x5E76;&#x5728;&#x8C03;&#x7528;<code>start</code>&#x4E4B;&#x524D;&#xFF0C;&#x5728;&#x6784;&#x9020;&#x51FD;&#x6570;&#x6216;setter&#x4E2D;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x52A8;&#x6001;&#x5C5E;&#x6027;&#x96C6;&#x7684;&#x5B9E;&#x73B0;&#x3002;</li>
</ol>
<p>&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;<code>Fiber</code>&#x7C7B;&#x53EF;&#x80FD;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x66F4;&#x7075;&#x6D3B;&#x5730;&#x8131;&#x79BB;&apos;<code>Thread</code>&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x6311;&#x6218;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6001;&#x8C03;&#x5EA6;&#x5668;&#x6CA1;&#x65E0;&#x6CD5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;CPU&#x6838;&#x5FC3;,&#x7ED9;&#x7EA4;&#x7A0B;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x6838;&#x5FC3;&#x662F;&#x7531;&#x90A3;&#x4E9B;&#x8FD0;&#x884C;&#x7684;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x6240;&#x505A;&#x7684;,&#x6240;&#x4EE5;&#x6BCF;&#x4E2A;&#x7EA4;&#x7A0B;&#x81F3;&#x5C11;&#x5728;&#x88AB;&#x8C03;&#x5EA6;&#x5230;&#x4E00;&#x4E2A;CPU&#x6838;&#x5FC3;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x5E95;&#x5C42;&#x7684;&#x5185;&#x6838;&#x7EBF;&#x7A0B;,&#x5C3D;&#x7BA1;&#x5E95;&#x5C42;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x8EAB;&#x4EFD;&#x5E76;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;,&#x5982;&#x679C;&#x8C03;&#x5EA6;&#x5668;&#x51B3;&#x5B9A;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x8C03;&#x5EA6;&#x5668;&#x662F;&#x7528;Java&#x7F16;&#x5199;&#x7684;&#x2014;&#x2014;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x90A3;&#x6837;&#x2014;&#x2014;&#x6BCF;&#x4E2A;&#x7EA4;&#x7A0B;&#x751A;&#x81F3;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5E95;&#x5C42;&#x7684;<code>Thread</code>&#x5B9E;&#x4F8B;&#x3002;&#x5982;&#x679C; <code>Fiber</code>&#x7C7B;&#x4EE3;&#x8868;&#x4E86;&#x7EA4;&#x7A0B;&#xFF0C;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x5219;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5E95;&#x5C42;&#x7684;<code>Thread</code>&#x5B9E;&#x4F8B;(&#x5982;<code>Thread.currentThread</code>&#x6216; <code>Thread.sleep</code>)&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x53D6;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7EA4;&#x7A0B;&#x7531;&#x76F8;&#x540C;&#x7684;<code>Thread</code>&#x7C7B;&#x8868;&#x793A;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x5C06;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7EA4;&#x7A0B;&#x7684;&#x5E95;&#x5C42;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x8BB8;&#x591A;&#x542B;&#x4E49;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5728;JVM&#x4E2D;&#x505A;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;JVM&#x5927;&#x91CF;&#x4F7F;&#x7528;<code>Thread</code>&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x77E5;&#x9053;&#x53EF;&#x80FD;&#x7684;&#x7EA4;&#x7A0B;&#x5B9E;&#x73B0;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x4F1A;&#x9650;&#x5236;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x5B83;&#x5728;&#x7F16;&#x5199;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x65F6;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x5FAA;&#x73AF;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5C06;&#x4ED6;&#x4EEC;&#x5206;&#x914D;&#x7ED9;&#x7EBF;&#x7A0B;(&#x5185;&#x6838;&#x7EBF;&#x7A0B;)&#x6765;<em>&#x5B9E;&#x73B0;</em>&#x7EBF;&#x7A0B;(&#x7EA4;&#x7A0B;)&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x516C;&#x5F00;&#x7EA4;&#x7A0B;(&#x7531;<code>Thread</code>&#x8868;&#x793A;)&#x7684;continuation&#xFF0C;&#x4EE5;&#x4FBF;&#x8C03;&#x5EA6;&#x5668;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x7EA4;&#x7A0B;&#x7531;Java&#x8C03;&#x5EA6;&#x5668;&#x6240;&#x8C03;&#x5EA6;,&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4E0D;&#x5FC5;&#x662F;GC&#x6839;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7EA4;&#x7A0B;&#x8981;&#x4E48;&#x662F;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x8C03;&#x5EA6;&#x5668;&#x6301;&#x6709;&#x5BF9;&#x5B83;&#x7684;&#x5F15;&#x7528;&#xFF1B;&#x8981;&#x4E48;&#x662F;&#x963B;&#x585E;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x963B;&#x585E;&#x5B83;&#x7684;&#x5BF9;&#x8C61;&#x6301;&#x6709;&#x5BF9;&#x5B83;&#x7684;&#x5F15;&#x7528;&#xFF08;&#x4F8B;&#x5982;&#x9501;&#x6216;IO&#x961F;&#x5217;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x53D6;&#x6D88;&#x963B;&#x585E;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x6D89;&#x53CA;&#x7EBF;&#x7A0B;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;&#x5F53;&#x524D;&#xFF0C;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x6570;&#x636E;&#x7531;&#xFF08;<code>Inheritable</code>&#xFF09;<code>ThreadLocal</code>&#x7C7B;&#x8868;&#x793A;&#x3002;&#x5982;&#x4F55;&#x5904;&#x7406;&#x7EA4;&#x7A0B;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x6570;&#x636E;&#xFF1F;&#x5173;&#x952E;&#x7684;&#x662F;&#xFF0C;<code>ThreadLocal</code>&#x6709;&#x4E24;&#x79CD;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6CD5;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x5C06;&#x6570;&#x636E;&#x4E0E;&#x7EBF;&#x7A0B;&#x4E0A;&#x4E0B;&#x6587;&#x76F8;&#x5173;&#x8054;&#x3002;&#x7EA4;&#x7A0B;&#x53EF;&#x80FD;&#x4E5F;&#x9700;&#x8981;&#x8FD9;&#x79CD;&#x80FD;&#x529B;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x662F;&#x901A;&#x8FC7;&#x4E32;&#x884C;&#x5316;&#x51CF;&#x5C11;&#x5E76;&#x53D1;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x7ADE;&#x4E89;&#x3002;&#x4F7F;&#x7528;<code>ThreadLocal</code>&#x4F5C;&#x4E3A;&#x5904;&#x7406;&#x5668;&#x672C;&#x5730;&#xFF08;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x662F;CPU&#x6838;&#x5FC3;&#x672C;&#x5730;&#xFF09;&#x7ED3;&#x6784;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#x3002;&#x6709;&#x4E86;&#x7EA4;&#x7A0B;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x9014;&#x9700;&#x8981;&#x6E05;&#x695A;&#x5730;&#x5206;&#x5F00;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x53EF;&#x80FD;&#x8D85;&#x8FC7;&#x6570;&#x767E;&#x4E07;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF08;&#x7EA4;&#x7A0B;&#xFF09;&#x8FD9;&#x6839;&#x672C;&#x4E0D;&#x662F;&#x5904;&#x7406;&#x5668;&#x672C;&#x5730;&#x6570;&#x636E;&#x7684;&#x826F;&#x597D;&#x7684;&#x8FD1;&#x4F3C;&#x3002;&#x5C06;&#x7EBF;&#x7A0B;&#x4F5C;&#x4E3A;&#x4E0A;&#x4E0B;&#x6587;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x7EBF;&#x7A0B;&#x4F5C;&#x4E3A;&#x5904;&#x7406;&#x5668;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#x8FDB;&#x884C;&#x66F4;&#x663E;&#x5F0F;&#x5904;&#x7406;&#x7684;&#x8981;&#x6C42;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x5B9E;&#x9645;&#x7684;<code>ThreadLocal</code>&#x7C7B;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x4E3A;&#x4E86;&#x4E32;&#x884C;&#x5316;&#x800C;&#x5C06;<code>Thread</code>&#x4F8B;&#x6620;&#x5C04;&#x5230;&#x6570;&#x636E;&#x7684;&#x4EFB;&#x4F55;&#x7C7B;&#x3002;&#x5982;&#x679C;&#x7EA4;&#x7A0B;&#x7531;<code>Thread</code>&#x8868;&#x793A;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5BF9;&#x8FD9;&#x79CD;&#x4E32;&#x884C;&#x5316;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x66F4;&#x6539;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7EA4;&#x7A0B;&#x7684;&#x6DFB;&#x52A0;&#x90FD;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x663E;&#x5F0F;API&#x6765;&#x8BBF;&#x95EE;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x8FD8;&#x662F;&#x8FD1;&#x4F3C;&#x7684;&#x3002;</p>
<p>&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#x662F;&#x57FA;&#x4E8E;&#x65F6;&#x95F4;&#x7247;&#x7684;&#x62A2;&#x5360;&#xFF08;&#x4E3A;&#x4E86;&#x7B80;&#x6D01;&#x8D77;&#x89C1;&#xFF0C;&#x8FD9;&#x91CC;&#x79F0;&#x4E4B;&#x4E3A;&#x5F3A;&#x5236;&#x62A2;&#x5360;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x5728;&#x6CA1;&#x6709;&#x963B;&#x585E;IO&#x6216;&#x7EBF;&#x7A0B;&#x540C;&#x6B65;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6267;&#x884C;&#x8FD0;&#x7B97;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x88AB;&#x5F3A;&#x5236;&#x62A2;&#x5360;&#x3002;&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x7EA4;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x51B3;&#x5B9A;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#xFF1B;JVM safepoint&#x7279;&#x6027;&#x5E94;&#x8BE5;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x2014;&#x2014;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x4EC5;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E14;&#x62E5;&#x6709;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF08;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x653E;&#x5F03;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#xFF09;&#x3002;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;&#x4E0E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x4E0D;&#x540C;&#xFF0C;&#x7EA4;&#x7A0B;&#x7684;&#x6570;&#x91CF;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x5927;&#xFF08;&#x51E0;&#x5341;&#x4E07;&#x751A;&#x81F3;&#x6570;&#x767E;&#x4E07;&#xFF09;&#x3002;&#x5982;&#x679C;<em>&#x8BB8;&#x591A;</em>&#x7EA4;&#x7A0B;&#x9700;&#x8981;&#x5982;&#x6B64;&#x591A;&#x7684;CPU&#x65F6;&#x95F4;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5B83;&#x4EEC;&#x9700;&#x8981;<em>&#x7ECF;&#x5E38;</em>&#x88AB;&#x5F3A;&#x5236;&#x62A2;&#x5360;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7EBF;&#x7A0B;&#x6570;&#x8D85;&#x8FC7;&#x5185;&#x6838;&#x6570;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8D44;&#x6E90;&#x5C06;&#x4E0D;&#x8DB3;&#x4EE5;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x7B26;&#x5408;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;<em>&#x8BB8;&#x591A;</em>&#x7EA4;&#x7A0B;<em>&#x4E0D;&#x7ECF;&#x5E38;</em>&#x9700;&#x8981;&#x8FD0;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#x5C06;&#x901A;&#x8FC7;&#x5C06;&#x7EA4;&#x7A0B;&#x5206;&#x914D;&#x7ED9;&#x53EF;&#x7528;&#x7684;&#x5185;&#x6838;&#xFF08;&#x5373;&#x5DE5;&#x4F5C;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF09;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x7EA4;&#x7A0B;&#x9700;&#x8981;&#x9891;&#x7E41;&#x5730;&#x8FD0;&#x884C;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x5728;&#x91CD;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF1B;&#x867D;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x5B9E;&#x73B0;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x6BD4;&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x597D;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x7684;&#x7EA4;&#x7A0B;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x6BD4;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x5B9E;&#x73B0;&#x529F;&#x80FD;&#x7684;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x662F;&#x5982;&#x4F55;&#x534F;&#x8C03;&#x7EA4;&#x7A0B;&#x4E0E;&#x4F1A;&#x963B;&#x585E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;JVM&#x5185;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x662F;&#x6697;&#x542B;&#x963B;&#x585E;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6BD4;&#x5982;&#x5C06;&#x7C7B;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x5230;&#x4F7F;&#x7528;&#x8005;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;<code>synchronized</code>&#x548C;<code>Object.wait</code>&#x3002;&#x7531;&#x4E8E;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x5C06;&#x8BB8;&#x591A;&#x7EA4;&#x7A0B;&#x591A;&#x8DEF;&#x590D;&#x7528;&#x5230;&#x4E00;&#x5C0F;&#x7EC4;&#x5DE5;&#x4F5C;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x963B;&#x585E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x6D88;&#x8017;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x7684;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E94;&#x8BE5;&#x88AB;&#x907F;&#x514D;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x9700;&#x8981;&#x5BF9;&#x7EA4;&#x7A0B;&#x53CB;&#x597D;&#xFF0C;&#x5373;&#x5982;&#x679C;&#x7531;&#x7EA4;&#x7A0B;&#x8C03;&#x7528;&#x963B;&#x585E;API&#xFF0C;&#x5219;&#x53EA;&#x963B;&#x585E;&#x7EA4;&#x7A0B;&#x800C;&#x4E0D;&#x662F;&#x5E95;&#x5C42;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x90FD;&#x53EF;&#x80FD;&#x7EE7;&#x7EED;&#x963B;&#x585E;&#x5E95;&#x5C42;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x4E00;&#x4E9B;API&#x963B;&#x585E;&#x7EA4;&#x7A0B;&#xFF0C;&#x800C;&#x8BA9;&#x53E6;&#x4E00;&#x4E9B;API&#x963B;&#x585E;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x3002;&#x6709;&#x5145;&#x5206;&#x7684;&#x7406;&#x7531;&#x76F8;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x963B;&#x585E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7C7B;&#x52A0;&#x8F7D;&#x53EA;&#x5728;&#x542F;&#x52A8;&#x671F;&#x95F4;&#x9891;&#x7E41;&#x53D1;&#x751F;&#xFF0C;&#x5728;&#x542F;&#x52A8;&#x4E4B;&#x540E;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x56F4;&#x7ED5;&#x8FD9;&#x79CD;&#x963B;&#x585E;&#x8FDB;&#x884C;&#x8C03;&#x5EA6;&#x3002;<em>synchronized</em>&#x7684;&#x8BB8;&#x591A;&#x7528;&#x6CD5;&#x53EA;&#x5728;&#x6781;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x4FDD;&#x62A4;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x548C;&#x963B;&#x585E;&#x7EBF;&#x7A0B;&#x2014;&#x5982;&#x6B64;&#x4E4B;&#x77ED;&#x4EE5;&#x81F3;&#x4E8E;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x3002;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x4FDD;&#x6301;<em>synchronized</em>&#x4E0D;&#x53D8;&#xFF0C;&#x5E76;&#x9F13;&#x52B1;&#x90A3;&#x4E9B;&#x7528;<em>synchronized</em>&#x5305;&#x56F4;IO&#x8BBF;&#x95EE;&#x5E76;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x9891;&#x7E41;&#x963B;&#x585E;&#x7684;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x60F3;&#x5728;&#x7EA4;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x66F4;&#x6539;&#x4EE3;&#x7801;&#x4EE5;&#x4F7F;&#x7528;<code>j.u.c</code>&#xFF08;&#x8FD9;&#x5C06;&#x662F;&#x7EA4;&#x7A0B;&#x53CB;&#x597D;&#x7684;&#xFF09;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5BF9;<code>Object.wait</code>&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x5728;&#x73B0;&#x4EE3;&#x4EE3;&#x7801;&#x4E2D;&#x5E76;&#x4E0D;&#x5E38;&#x89C1;&#xFF08;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8BA4;&#x4E3A;&#x662F;&#x8FD9;&#x6837;&#xFF09;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5219;&#x662F;&#x4F7F;&#x7528;&#x4E86;<code>j.u.c</code>&#x7684;&#x7C7B;&#x4F3C;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x963B;&#x585E;&#x5176;&#x5E95;&#x5C42;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x7EA4;&#x7A0B;&#x90FD;&#x4F1A;&#x89E6;&#x53D1;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x7528;JFR/mbean&#x76D1;&#x89C6;&#x7684;&#x7CFB;&#x7EDF;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x867D;&#x7136;&#x7EA4;&#x7A0B;&#x9F13;&#x52B1;&#x4F7F;&#x7528;&#x666E;&#x901A;&#x3001;&#x7B80;&#x5355;&#x548C;&#x81EA;&#x7136;&#x7684;&#x540C;&#x6B65;&#x963B;&#x585E;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x5F88;&#x5BB9;&#x6613;&#x5C06;&#x73B0;&#x6709;&#x7684;&#x5F02;&#x6B65;api&#x6539;&#x7F16;&#x6210;&#x7EA4;&#x7A0B;&#x963B;&#x585E;&#x4EE3;&#x7801;&#x3002;&#x5047;&#x8BBE;&#x5E93;&#x4E3A;&#x67D0;&#x4E2A;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;<code>foo</code>&#x516C;&#x5F00;&#x4E86;&#x8FD9;&#x4E2A;&#x5F02;&#x6B65;API&#xFF0C;&#x8BE5;&#x64CD;&#x4F5C;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<code>String</code>&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">AsyncFoo</span> </span>{
   <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">asyncFoo</span><span class="hljs-params">(FooCompletion callback)</span></span>;
}
</code></pre>
<p>&#x5176;&#x4E2D;&#x56DE;&#x8C03;&#x6216;&#x5B8C;&#x6210;&#x5904;&#x7406;&#x5668;<code>FooCompletion</code>&#x7684;&#x5B9A;&#x4E49;&#x5982;&#x4E0B;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">FooCompletion</span> </span>{
  <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">success</span><span class="hljs-params">(String result)</span></span>;
  <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">failure</span><span class="hljs-params">(FooException exception)</span></span>;
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x5C06;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x5230;&#x7EA4;&#x7A0B;&#x963B;&#x585E;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">abstract</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">_AsyncToBlocking</span>&lt;<span class="hljs-title">T</span>, <span class="hljs-title">E</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">Throwable</span>&gt; </span>{
    <span class="hljs-keyword">private</span> _Fiber f;
    <span class="hljs-keyword">private</span> T result;
    <span class="hljs-keyword">private</span> E exception;

    <span class="hljs-function"><span class="hljs-keyword">protected</span> <span class="hljs-keyword">void</span> <span class="hljs-title">_complete</span><span class="hljs-params">(T result)</span> </span>{
        <span class="hljs-keyword">this</span>.result = result;
        unpark f
    }

    <span class="hljs-function"><span class="hljs-keyword">protected</span> <span class="hljs-keyword">void</span> <span class="hljs-title">_fail</span><span class="hljs-params">(E exception)</span> </span>{ 
        <span class="hljs-keyword">this</span>.exception = exception;
        unpark f
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> T <span class="hljs-title">run</span><span class="hljs-params">()</span> <span class="hljs-keyword">throws</span> E </span>{ 
        <span class="hljs-keyword">this</span>.f = <span class="hljs-function">current fiber
        <span class="hljs-title">register</span><span class="hljs-params">()</span></span>;
        <span class="hljs-function">park
        <span class="hljs-title">if</span> <span class="hljs-params">(exception != <span class="hljs-keyword">null</span>)</span>
           throw exception</span>;
        <span class="hljs-keyword">return</span> result;
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> T <span class="hljs-title">run</span><span class="hljs-params">(_timeout)</span> <span class="hljs-keyword">throws</span> E, TimeoutException </span>{ ... }

    <span class="hljs-function"><span class="hljs-keyword">abstract</span> <span class="hljs-keyword">void</span> <span class="hljs-title">register</span><span class="hljs-params">()</span></span>;
}
</code></pre>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4EE5;&#x4E0B;&#x7C7B;&#x6765;&#x521B;&#x5EFA;API&#x7684;&#x963B;&#x585E;&#x7248;&#x672C;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">abstract</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">AsyncFooToBlocking</span> <span class="hljs-keyword">extends</span> <span class="hljs-title">_AsyncToBlocking</span>&lt;<span class="hljs-title">String</span>, <span class="hljs-title">FooException</span>&gt; 
     <span class="hljs-keyword">implements</span> <span class="hljs-title">FooCompletion</span> </span>{
  <span class="hljs-meta">@Override</span>
  <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">success</span><span class="hljs-params">(String result)</span> </span>{
    _complete(result);
  }
  <span class="hljs-meta">@Override</span>
  <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">failure</span><span class="hljs-params">(FooException exception)</span> </span>{
    _fail(exception);
  }
}
</code></pre>
<p>&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5B83;&#x5C06;&#x5F02;&#x6B65;API&#x5305;&#x88C5;&#x4E3A;&#x540C;&#x6B65;&#x7248;&#x672C;:</p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">SyncFoo</span> </span>{
    AsyncFoo foo = get instance;

    <span class="hljs-function">String <span class="hljs-title">syncFoo</span><span class="hljs-params">()</span> <span class="hljs-keyword">throws</span> FooException </span>{
        <span class="hljs-keyword">new</span> AsyncFooToBlocking() {
          <span class="hljs-meta">@Override</span> <span class="hljs-function"><span class="hljs-keyword">protected</span> <span class="hljs-keyword">void</span> <span class="hljs-title">register</span><span class="hljs-params">()</span> </span>{ foo.asyncFoo(<span class="hljs-keyword">this</span>); }
        }.run();
    }
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x5E38;&#x89C1;&#x7684;&#x5F02;&#x6B65;&#x7C7B;&#xFF08;&#x5982;<code>CompletableFuture</code>&#xFF09;&#x6DFB;&#x52A0;&#x8FD9;&#x79CD;&#x6269;&#x5C55;</p>
<h2 id="continuations">Continuations</h2>
<p>&#x5C06;continuation&#x6DFB;&#x52A0;&#x5230;Java&#x5E73;&#x53F0;&#x7684;&#x52A8;&#x673A;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x7EA4;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;continuation&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x6709;&#x8DA3;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;continuation&#x4F5C;&#x4E3A;&#x516C;&#x5171;API&#x63D0;&#x4F9B;&#x662F;&#x672C;&#x9879;&#x76EE;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x76EE;&#x6807;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E9B;&#x5176;&#x4ED6;&#x7528;&#x9014;&#x7684;&#x4F5C;&#x7528;&#x9884;&#x8BA1;&#x8FDC;&#x4F4E;&#x4E8E;&#x7EA4;&#x7A0B;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;continuation&#x5E76;&#x4E0D;&#x80FD;&#x5728;&#x7EA4;&#x7A0B;&#x4E0A;&#x589E;&#x52A0;&#x8868;&#x73B0;&#x529B;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7EA4;&#x7A0B;&#x4E0A;&#x5B9E;&#x73B0;&#x8FDE;&#x7EED;&#x4F53;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x672C;&#x6587;&#x6863;&#x548C;ProjectLoom&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#xFF0C;<em>continuation</em>&#x4E00;&#x8BCD;&#x90FD;&#x8868;&#x793A;<em>delimited continuation</em>&#xFF08;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;<em>coroutine</em><a href="https://cr.openjdk.java.net/~rpressler/loom/Loom-Proposal.html#dfref-footnote-1" target="_blank">1</a>&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x628A;<em>delimited continuation</em>&#x770B;&#x4F5C;&#x53EF;&#x4EE5;&#x6302;&#x8D77;&#xFF08;&#x81EA;&#x8EAB;&#xFF09;&#x548C;&#x6062;&#x590D;&#xFF08;&#x7531;&#x8C03;&#x7528;&#x65B9;&#x6062;&#x590D;&#xFF09;&#x7684;&#x987A;&#x5E8F;&#x4EE3;&#x7801;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x66F4;&#x719F;&#x6089;&#x5C06;continuation&#x89C6;&#x4E3A;&#x8868;&#x793A;&#x8BA1;&#x7B97;&#x7684;&#x201C;&#x5269;&#x4F59;&#x201D;&#x6216;&#x201C;&#x672A;&#x6765;&#x201D;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x5B50;&#x5B50;&#x7A0B;&#x5E8F;&#xFF09;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x4E24;&#x8005;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x4E00;&#x4E2A;&#x6302;&#x8D77;&#x7684;continuation&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5F53;&#x6062;&#x590D;&#x6216;&#x201C;&#x8C03;&#x7528;&#x201D;&#x65F6;&#xFF0C;&#x5B83;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x7684;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x3002;</p>
<p>delimited continuation&#x662F;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x5165;&#x53E3;&#x70B9;&#xFF08;&#x5982;&#x7EBF;&#x7A0B;&#xFF09;&#x7684;continuation&#x5B50;&#x7A0B;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<em>entry point</em>&#xFF08;&#x5728;Scheme&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;<em>reset point</em>&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x4E2A;&#x70B9;&#x6682;&#x505C;&#x6216;&#x6267;&#x884C;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<em>suspension point</em>&#x6216;<em>yield point</em>&#xFF08;&#x5728;Scheme&#x4E2D;&#xFF0C;&#x8FD9;&#x662F;<em>shift</em>point&#xFF09;&#x3002;&#x5F53;&#x4E00;&#x4E2A;delimited continuation&#x6302;&#x8D77;&#x65F6;&#xFF0C;&#x63A7;&#x5236;&#x6743;&#x88AB;&#x4F20;&#x9012;&#x5230;continuation&#x7684;&#x5916;&#x90E8;&#xFF0C;&#x5F53;&#x5B83;&#x88AB;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;<em>yield point</em>&#xFF0C;&#x6267;&#x884C;&#x4E0A;&#x4E0B;&#x6587;&#x4E00;&#x76F4;&#x4FDD;&#x5B58;&#x5728;<em>entry point</em>&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8868;&#x793A;delimited continuation&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;Java&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;</p>
<pre><code class="lang-java">foo() { <span class="hljs-comment">// (2)</span>
  ... 
  bar()
  ...
}

bar() {
  ...
  suspend <span class="hljs-comment">// (3)</span>
  ... <span class="hljs-comment">// (5)</span>
}

main() {
  c = continuation(foo) <span class="hljs-comment">// (0)</span>
  c.<span class="hljs-keyword">continue</span>() <span class="hljs-comment">// (1)</span>
  c.<span class="hljs-keyword">continue</span>() <span class="hljs-comment">// (4)</span>
}
</code></pre>
<p>&#x5728;&#xFF08;0&#xFF09;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;continuation&#xFF0C;&#x4ED6;&#x7684;<em>entry point</em>&#x662F;&#x65B9;&#x6CD5;<code>foo</code>&#xFF1B;&#x7136;&#x540E;&#x5B83;&#x5728;&#xFF08;1&#xFF09;&#x5904;&#x88AB;&#x8C03;&#x7528;&#x628A;&#x63A7;&#x5236;&#x6743;&#x4F20;&#x9012;&#x7ED9;&#xFF08;2&#xFF09;&#x5904;&#x7684;continuation&#x7684; entry point&#xFF0C;&#x7136;&#x540E;&#x5B83;&#x5C06;&#x6267;&#x884C;&#x5230;&#x5728;&#x5B50;&#x7A0B;&#x5E8F;<code>bar</code>&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x6302;&#x8D77;&#x70B9;&#xFF08;3&#xFF09;&#xFF0C;&#x6B64;&#x65F6;&#x8FD4;&#x56DE;&#x4E86;&#xFF08;1&#xFF09;&#x5904;&#x7684;&#x8C03;&#x7528;&#x3002;&#x5F53;continuation&#x5728;&#xFF08;4&#xFF09;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x5230;&#xFF08;5&#xFF09;&#x6240;&#x5728;&#x7684;&#x6302;&#x8D77;&#x70B9;</p>
<p>&#x8FD9;&#x91CC;&#x8BA8;&#x8BBA;&#x7684;continuation&#x662F;&#x201C;stackful&#x201D;&#xFF0C;&#x56E0;&#x4E3A;continuation&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5806;&#x6808;&#x7684;&#x4EFB;&#x4F55;&#x5D4C;&#x5957;&#x6DF1;&#x5EA6;&#x5904;&#x963B;&#x585E;&#xFF08;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5728;&#x51FD;&#x6570;<code>bar</code>&#x5185;&#x90E8;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x7531;<code>foo</code>&#x8C03;&#x7528;&#xFF0C;<code>foo</code>&#x662F;&#x5165;&#x53E3;&#x70B9;&#xFF09;&#x3002;&#x76F8;&#x53CD;&#xFF0C;stackless continuation&#x53EA;&#x80FD;&#x6302;&#x8D77;&#x5728;&#x4E0E;&#x5165;&#x53E3;&#x70B9;&#x76F8;&#x540C;&#x7684;&#x5B50;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x91CC;&#x8BA8;&#x8BBA;&#x7684;continuation&#x662F;&#x4E0D;&#x53EF;&#x91CD;&#x5165;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x5BF9;continuation&#x7684;&#x8C03;&#x7528;&#x90FD;&#x53EF;&#x80FD;&#x66F4;&#x6539;&#x201C;&#x5F53;&#x524D;&#x201D;&#x6302;&#x8D77;&#x70B9;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;continuation&#x5BF9;&#x8C61;&#x662F;&#x6709;&#x72B6;&#x6001;&#x7684;&#x3002;</p>
<p>&#x5B9E;&#x73B0;continuations&#x7684;&#x4E3B;&#x8981;&#x6280;&#x672F;&#x4EFB;&#x52A1;&#x2014;&#x2014;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x4EFB;&#x52A1;&#x2014;&#x2014;&#x662F;&#x4E3A;HotSpot&#x6DFB;&#x52A0;&#x6355;&#x83B7;&#x3001;&#x5B58;&#x50A8;&#x548C;&#x6062;&#x590D;&#x8C03;&#x7528;&#x5806;&#x6808;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F5C;&#x4E3A;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;JNI&#x5806;&#x6808;&#x5E27;&#x53EF;&#x80FD;&#x4E0D;&#x53D7;&#x652F;&#x6301;&#x3002;</p>
<p>&#x7531;&#x4E8E;continuations&#x662F;&#x7EA4;&#x7A0B;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5982;&#x679C;continuation&#x4F5C;&#x4E3A;&#x516C;&#x5171;API&#x516C;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9700;&#x8981;&#x652F;&#x6301;&#x5D4C;&#x5957;&#x7684;continuation&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;continuation&#x5185;&#x90E8;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x4EC5;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x6302;&#x8D77;continuation&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x6302;&#x8D77;&#x5C01;&#x95ED;&#x7684;continuation&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6302;&#x8D77;&#x5C01;&#x95ED;&#x7684;&#x7EA4;&#x7A0B;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;continuation&#x7684;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7528;&#x6CD5;&#x662F;&#x5728;&#x751F;&#x6210;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x3002;&#x751F;&#x6210;&#x5668;&#x516C;&#x5F00;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x6B21;&#x751F;&#x6210;&#x8FED;&#x4EE3;&#x5668;&#x65F6;&#xFF0C;&#x5728;&#x751F;&#x6210;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x4F1A;&#x4E3A;&#x8FED;&#x4EE3;&#x5668;&#x751F;&#x6210;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">new</span> _Fiber(() -&gt; {
  <span class="hljs-keyword">for</span> (Object x : <span class="hljs-keyword">new</span> _Generator(() -&gt; {
      produce <span class="hljs-number">1</span>
      fiber sleep <span class="hljs-number">100</span>ms
      produce <span class="hljs-number">2</span>
      fiber sleep <span class="hljs-number">100</span>ms
      produce <span class="hljs-number">3</span>
  })) {
      System.out.println(<span class="hljs-string">&quot;Next: &quot;</span> + x);
  }
})
</code></pre>
<p>&#x5728;&#x53C2;&#x8003;&#x6587;&#x732E;&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x7684;&#x5D4C;&#x5957;&#x8FDE;&#x7EED;&#x4F53;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x201C;delimited continuations with multiple named prompts&#x201D;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x79F0;&#x4E3A;<em>&#x4F5C;&#x7528;&#x57DF;&#x8BA1;&#x7B97;&#x7EED;&#x4F53;</em>&#x3002;&#x8BF7;&#x53C2;&#x9605;<a href="http://blog.paralleluniverse.co/2015/08/07/scoped-continuations/" target="_blank">&#x8BE5;&#x535A;&#x5BA2;</a>&#x8BA8;&#x8BBA;&#x9650;&#x5B9A;&#x8303;&#x56F4;&#x8FDE;&#x7EED;&#x4F53;&#x7684;&#x7406;&#x8BBA;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF08;&#x5BF9;&#x90A3;&#x4E9B;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;continuation&#x662F;&#x4E00;&#x79CD;&#x201C;&#x4E00;&#x822C;&#x6548;&#x679C;&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x4EFB;&#x4F55;&#x6548;&#x679C;-&#x4F8B;&#x5982;&#x8D4B;&#x503C;-&#x5373;&#x4F7F;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x7EAF;&#x8BED;&#x8A00;&#x4E2D;&#xFF1B;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;continuation&#x662F;&#x547D;&#x4EE4;&#x5F0F;&#x7F16;&#x7A0B;&#x7684;&#x57FA;&#x672C;&#x62BD;&#x8C61;&#xFF09;&#x3002;</p>
<p>&#x5728;continuation&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x5E94;&#x8BE5;&#x5F15;&#x7528;continuation&#x5B9E;&#x4F8B;&#xFF0C;&#x5E76;&#x4E14;&#x4F5C;&#x7528;&#x57DF;&#x901A;&#x5E38;&#x6709;&#x4E00;&#x4E9B;&#x56FA;&#x5B9A;&#x7684;&#x540D;&#x79F0;&#xFF08;&#x56E0;&#x6B64;&#x6302;&#x8D77;&#x4F5C;&#x7528;&#x57DF;<code>A</code>&#x5C06;&#x6302;&#x8D77;&#x4F5C;&#x7528;&#x57DF;<code>A</code>&#x6700;&#x5185;&#x5C42;&#x7684;&#x5C01;&#x95ED;continuation&#xFF09;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x8BA9;&#x51FA;&#x70B9;&#xFF08;yield point&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4FE1;&#x606F;&#x4ECE;&#x4EE3;&#x7801;&#x4F20;&#x9012;&#x5230;continuation&#x5B9E;&#x4F8B;&#x5E76;&#x8FD4;&#x56DE;&#x3002; &#x5F53;continuation&#x6302;&#x8D77;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x5305;&#x56F4;&#x8BA9;&#x51FA;&#x70B9;<code>&#x201C;try/finally</code>&#x5757;&#xFF08;&#x5373;&#xFF0C;&#x5728;continuation&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x65E0;&#x6CD5;&#x610F;&#x8BC6;&#x5230;&#x5230;&#x5B83;&#x6B63;&#x5728;&#x6302;&#x8D77;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF09;&#x3002; </p>
<p>&#x5C06;continuation&#x5B9E;&#x73B0;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x7EA4;&#x7A0B;&#x7ED3;&#x6784;&#xFF08;&#x65E0;&#x8BBA;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x4F5C;&#x4E3A;&#x516C;&#x5171; API &#x516C;&#x5F00;&#xFF09;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x662F;&#x660E;&#x786E;&#x5730;&#x5C06;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x79BB;&#x3002; &#x56E0;&#x6B64;&#xFF0C;continuation&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x4F1A;&#x521B;&#x5EFA;&#x8DE8;&#x7EBF;&#x7A0B;&#x7684;happens-before&#x5173;&#x7CFB;&#x3002;&#x7EA4;&#x7A0B;&#x5FC5;&#x987B;&#x8981;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x804C;&#x8D23;&#xFF0C;&#x5373;&#x786E;&#x4FDD;&#x5C06;continuation&#x4ECE;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x8FC1;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x89C1;&#x6027;</p>
<p>&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E86;&#x53EF;&#x80FD;&#x7684; API &#x7684;&#x7C97;&#x7565;&#x6982;&#x8FF0;&#x3002; Continuations &#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x539F;&#x8BED;&#xFF0C;&#x53EA;&#x4F1A;&#x88AB;&#x5E93;&#x4F5C;&#x8005;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x5C31;&#x50CF; <code>java.util.Stream</code> &#x5B9E;&#x73B0;&#x5229;&#x7528;&#x4E86; <code>Spliterator</code>&#xFF09;&#x3002; &#x9884;&#x8BA1;&#x4F7F;&#x7528;continuation&#x7684;&#x7C7B;&#x5C06;&#x62E5;&#x6709;continuation&#x7C7B;&#x7684;&#x79C1;&#x6709;&#x5B9E;&#x4F8B;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5B83;&#x7684;&#x5B50;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;continuation&#x5B9E;&#x4F8B;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x66B4;&#x9732;&#x7ED9;&#x8BE5;&#x7ED3;&#x6784;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x3002; </p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">_Continuation</span> </span>{
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">_Continuation</span><span class="hljs-params">(_Scope scope, Runnable target)</span> 
    <span class="hljs-keyword">public</span> <span class="hljs-keyword">boolean</span> <span class="hljs-title">run</span><span class="hljs-params">()</span>
    <span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> _Continuation <span class="hljs-title">suspend</span><span class="hljs-params">(_Scope scope, Consumer&lt;_Continuation&gt; ccc)</span>

    <span class="hljs-keyword">public</span> ? <span class="hljs-title">getStackTrace</span><span class="hljs-params">()</span>
}
</span></code></pre>
<p><code>run</code> &#x65B9;&#x6CD5;&#x5728;continuation&#x7EC8;&#x6B62;&#x65F6;&#x8FD4;&#x56DE; <code>true</code>&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x6302;&#x8D77;&#x5219;&#x8FD4;&#x56DE; false&#x3002; <code>suspend</code> &#x65B9;&#x6CD5;&#x5141;&#x8BB8;&#x5C06;&#x4FE1;&#x606F;&#x4ECE;&#x8BA9;&#x51FA;&#x70B9;&#x4F20;&#x9012;&#x5230;continuation&#xFF08;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>ccc</code>&#x8FD9;&#x4E2A;&#x56DE;&#x8C03;&#x628A;&#x4FE1;&#x606F;&#x6CE8;&#x5165;&#x5230;&#x7ED9;&#x5B9A;&#x7684;continuation&#x5B9E;&#x4F8B;&#x4E2D;&#xFF09;&#xFF0C;&#x5E76;&#x4ECE;continuation&#x8FD4;&#x56DE;&#x5230;&#x6302;&#x8D77;&#x70B9;&#xFF08;&#x4F7F;&#x7528;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x4FE1;&#x606F;&#x7684;&#x8FD4;&#x56DE;&#x503C; &#xFF0C;&#x5176;&#x5C31;&#x662F;continuation&#x672C;&#x8EAB;&#xFF09;&#x3002; </p>
<p>&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x5728;continuation&#x65B9;&#x9762;&#x5B9E;&#x73B0;&#x7EA4;&#x7A0B;&#x662F;&#x591A;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;&#x8868;&#x793A;&#x7EA4;&#x7A0B;&#x7684; <code>_Fiber</code> &#x7C7B;&#x7684;&#x90E8;&#x5206;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#x3002; &#x6B63;&#x5982;&#x60A8;&#x5C06;&#x6CE8;&#x610F;&#x5230;&#x7684;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x5728;&#x7EF4;&#x62A4;&#x7EA4;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x4E0D;&#x4F1A;&#x88AB;&#x540C;&#x65F6;&#x8C03;&#x5EA6;&#x591A;&#x6B21;&#xFF1A; </p>
<pre><code class="lang-java"><span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">_Fiber</span> </span>{
    <span class="hljs-keyword">private</span> <span class="hljs-keyword">final</span> _Continuation cont;
    <span class="hljs-keyword">private</span> <span class="hljs-keyword">final</span> Executor scheduler;
    <span class="hljs-keyword">private</span> <span class="hljs-keyword">volatile</span> State state;
    <span class="hljs-keyword">private</span> <span class="hljs-keyword">final</span> Runnable task;

    <span class="hljs-keyword">private</span> <span class="hljs-keyword">enum</span> State { NEW, LEASED, RUNNABLE, PAUSED, DONE; }

    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-title">_Fiber</span><span class="hljs-params">(Runnable target, Executor scheduler)</span> </span>{
        <span class="hljs-keyword">this</span>.scheduler = scheduler;
        <span class="hljs-keyword">this</span>.cont = <span class="hljs-keyword">new</span> _Continuation(_FIBER_SCOPE, target);

        <span class="hljs-keyword">this</span>.state = State.NEW;
        <span class="hljs-keyword">this</span>.task = () -&gt; {
              <span class="hljs-keyword">while</span> (!cont.run()) {
                  <span class="hljs-keyword">if</span> (park0())
                     <span class="hljs-keyword">return</span>; <span class="hljs-comment">// parking; otherwise, had lease -- continue</span>
              }
              state = State.DONE;
        };
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">start</span><span class="hljs-params">()</span> </span>{
        <span class="hljs-keyword">if</span> (!casState(State.NEW, State.RUNNABLE))
            <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> IllegalStateException();
        scheduler.execute(task);
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">park</span><span class="hljs-params">()</span> </span>{
        _Continuation.suspend(_FIBER_SCOPE, <span class="hljs-keyword">null</span>);
    }

    <span class="hljs-function"><span class="hljs-keyword">private</span> <span class="hljs-keyword">boolean</span> <span class="hljs-title">park0</span><span class="hljs-params">()</span> </span>{
        State st, nst;
        do {
            st = state;
            <span class="hljs-keyword">switch</span> (st) {
              <span class="hljs-keyword">case</span> LEASED:   nst = State.RUNNABLE; <span class="hljs-keyword">break</span>;
              <span class="hljs-keyword">case</span> RUNNABLE: nst = State.PAUSED;   <span class="hljs-keyword">break</span>;
              <span class="hljs-keyword">default</span>:       <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> IllegalStateException();
            }
        } <span class="hljs-keyword">while</span> (!casState(st, nst));
        <span class="hljs-keyword">return</span> nst == State.PAUSED;
    }

    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">unpark</span><span class="hljs-params">()</span> </span>{
        State st, nst;
        do {
            State st = state;
            <span class="hljs-keyword">switch</span> (st) {
              <span class="hljs-keyword">case</span> LEASED: 
              <span class="hljs-keyword">case</span> RUNNABLE: nst = State.LEASED;   <span class="hljs-keyword">break</span>;
              <span class="hljs-keyword">case</span> PAUSED:   nst = State.RUNNABLE; <span class="hljs-keyword">break</span>;
              <span class="hljs-keyword">default</span>:       <span class="hljs-keyword">throw</span> <span class="hljs-keyword">new</span> IllegalStateException();
            }
        } <span class="hljs-keyword">while</span> (!casState(st, nst));
        <span class="hljs-keyword">if</span> (nst == State.RUNNABLE)
            scheduler.execute(task);
    }

    <span class="hljs-function"><span class="hljs-keyword">private</span> <span class="hljs-keyword">boolean</span> <span class="hljs-title">casState</span><span class="hljs-params">(State oldState, State newState)</span> </span>{ ... }  
}
</code></pre>
<h2 id="&#x8C03;&#x5EA6;&#x5668;">&#x8C03;&#x5EA6;&#x5668;</h2>
<p>&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x50CF;<code>ForkJoinPools</code>&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x7A83;&#x53D6;&#x8C03;&#x5EA6;&#x5668;&#x7279;&#x522B;&#x9002;&#x5408;&#x8C03;&#x5EA6;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;IO&#x8FDB;&#x884C;&#x901A;&#x8BAF;&#x4E14;&#x963B;&#x585E; &#x6216;&#x7ECF;&#x5E38;&#x4E0E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x901A;&#x4FE1;&#x7684;&#x7EBF;&#x7A0B;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x7EA4;&#x7A0B;&#x5C06;&#x5177;&#x6709;&#x53EF;&#x63D2;&#x62D4;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x5C06;&#x80FD;&#x591F;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x8C03;&#x5EA6;&#x5668;&#xFF08;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x7684; SPI &#x53EF;&#x4EE5;&#x50CF;<code>Executor</code>&#x4E00;&#x6837;&#x7B80;&#x5355;&#xFF09;&#x3002; &#x6839;&#x636E;&#x4E4B;&#x524D;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x9884;&#x8BA1;&#x5F02;&#x6B65;&#x6A21;&#x5F0F;&#x4E0B;&#x7684; <code>ForkJoinPool</code>&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x7528;&#x9014;&#x7684;&#x4F18;&#x79C0;&#x9ED8;&#x8BA4;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8FD8;&#x60F3;&#x63A2;&#x7D22;&#x4E00;&#x4E24;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F8B;&#x5982; pinned-scheduler&#xFF0C; &#x603B;&#x662F;&#x5C06;&#x7ED9;&#x5B9A;&#x7684;&#x7EA4;&#x7A0B;&#x8C03;&#x5EA6;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x5185;&#x6838;&#x7EBF;&#x7A0B;&#xFF08;&#x5047;&#x5B9A;&#x8BE5;&#x7EBF;&#x7A0B;&#x56FA;&#x5B9A;&#x5230;&#x5904;&#x7406;&#x5668;&#x6838;&#x5FC3;&#xFF09;&#x3002; </p>
<h2 id="unwind-and-invoke">Unwind-and-Invoke</h2>
<p>&#x8BD1;&#x8005;&#xFF1A;unwind-and-invoke&#x89C1;&#x4E0A;&#x6587; &#x6B64;&#x529F;&#x80FD;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x7EA4;&#x7A0B;&#x7684;&#x5806;&#x6808;&#x6062;&#x590D;</p>
<p>&#x4E0E;continuation&#x4E0D;&#x540C;&#xFF0C;&#x5C55;&#x5F00;&#x7684;&#x5806;&#x6808;&#x5E27;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x4F1A;&#x88AB;&#x4FDD;&#x7559;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x4F8B;&#x5316;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x3002;</p>
<p>TBD</p>
<h2 id="&#x5176;&#x4F59;&#x7684;&#x6311;&#x6218;">&#x5176;&#x4F59;&#x7684;&#x6311;&#x6218;</h2>
<p>&#x867D;&#x7136;&#x6B64;&#x76EE;&#x6807;&#x7684;&#x4E3B;&#x8981;&#x52A8;&#x673A;&#x662F;&#x4F7F;&#x5E76;&#x53D1;&#x66F4;&#x5BB9;&#x6613;/&#x66F4;&#x5177;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C; &#x9664;&#x4E86;Java &#x8FD0;&#x884C;&#x65F6;&#x5B9E;&#x73B0;&#x7684;&#x7EBF;&#x7A0B;&#x4EE5;&#x53CA;&#x8FD0;&#x884C;&#x65F6;&#x5BF9;&#x5176;&#x5177;&#x6709;&#x66F4;&#x591A;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x597D;&#x5904;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x6682;&#x505C;&#x548C;&#x5E8F;&#x5217;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x53CD;&#x5E8F;&#x5217;&#x5316;&#x548C;&#x6062;&#x590D;&#x3002; &#x8FD9;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4ECE;&#x66F4;&#x9760;&#x8FD1;&#x5B83;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x53D7;&#x76CA;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x63D0;&#x4F9B; <a href="https://en.wikipedia.org/wiki/Function_as_a_Service" target="_blank">function-as-a-service</a> &#x7684;&#x4E91;&#x5E73;&#x53F0;&#x4E2D; &#xFF0C;&#x5176;&#x4E2D;&#x8FD0;&#x884C;&#x7528;&#x6237;&#x4EE3;&#x7801;&#x7684;&#x673A;&#x5668;&#x5B9E;&#x4F8B;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x4EE3;&#x7801;&#x7B49;&#x5F85;&#x67D0;&#x4E9B;&#x5916;&#x90E8;&#x4E8B;&#x4EF6;&#x65F6;&#x7EC8;&#x6B62;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E0A;&#x6062;&#x590D;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x7406;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x4ECE;&#x800C;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x53EF;&#x7528;&#x8D44;&#x6E90;&#x5E76;&#x964D;&#x4F4E;&#x4E3B;&#x673A;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6210;&#x672C;&#x3002; &#x4E00;&#x4E2A;&#x7EA4;&#x7A0B;&#x5C06;&#x62E5;&#x6709;&#x50CF;<code>parkAndSerialize</code>&#x548C;<code>deserializeAndUnpark</code>&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x3002; </p>
<p>&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x7EA4;&#x7A0B;&#x662F;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#xFF0C;&#x56E0;&#x6B64;continuation&#x4E5F;&#x5E94;&#x8BE5;&#x662F;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x3002; &#x5982;&#x679C;&#x5B83;&#x4EEC;&#x662F;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x59A8;&#x8BA9;&#x5B83;&#x4EEC;&#x53EF;&#x514B;&#x9686;&#xFF0C;&#x56E0;&#x4E3A;&#x514B;&#x9686;continuation&#x7684;&#x80FD;&#x529B;&#x5B9E;&#x9645;&#x4E0A;&#x589E;&#x52A0;&#x4E86;&#x8868;&#x73B0;&#x529B;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x56DE;&#x5230;&#x4EE5;&#x524D;&#x7684;&#x6682;&#x505C;&#x70B9;&#xFF09;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x8BA9;continuation&#x53EF;&#x4EE5;&#x88AB;&#x514B;&#x9686;&#x4E14;&#x5BF9;&#x6B64;&#x7C7B;&#x7528;&#x5904;&#x6765;&#x8BF4;&#x8DB3;&#x591F;&#x597D;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x56E0;&#x4E3A; Java &#x4EE3;&#x7801;&#x5728;&#x5806;&#x6808;&#x5916;&#x5B58;&#x50A8;&#x4E86;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x8981;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x514B;&#x9686;&#x9700;&#x8981;&#x4EE5;&#x67D0;&#x79CD;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x65B9;&#x5F0F;&#x201C;&#x6DF1;&#x5165;&#x201D;&#x3002;</p>
<h2 id="&#x5176;&#x4ED6;&#x65B9;&#x6CD5;">&#x5176;&#x4ED6;&#x65B9;&#x6CD5;</h2>
<p>&#x5BF9;&#x4E8E;&#x5E76;&#x53D1;&#x6027;&#x7684;&#x7B80;&#x5355;&#x6027;&#x4E0E;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x7684;&#x7EA4;&#x7A0B;&#x7684;&#x66FF;&#x4EE3;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x79F0;&#x4E3A; async/await&#xFF0C;&#x5E76;&#x5DF2;&#x88AB; C# &#x548C; Node.js &#x91C7;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x53EF;&#x80FD;&#x88AB;&#x6807;&#x51C6; JavaScript &#x91C7;&#x7528;&#x3002;continuation&#x548C;&#x7EA4;&#x7A0B;&#x5728; async/await &#x4E2D;&#x5360;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x56E0;&#x4E3A; async/await &#x5F88;&#x5BB9;&#x6613;&#x7528;continuation&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x79CD;&#x5F31;&#x5F62;&#x5F0F;&#x7684;delimited continuation&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x79F0;&#x4E3A;&#x65E0;&#x6808;continuation&#xFF0C;&#x5B83;&#x4E0D;&#x6355;&#x83B7;&#x6574;&#x4E2A;&#x8C03;&#x7528;&#x5806;&#x6808;&#xFF0C;&#x4F46;&#x4FDD;&#x5B58;&#x4EC5;&#x5355;&#x4E2A;&#x5B50;&#x7A0B;&#x5E8F;&#x7684;&#x672C;&#x5730;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
<p>While implementing async/await is easier than full-blown continuations and fibers, that solution falls far too short of addressing the problem. While async/await makes code simpler and gives it the appearance of normal, sequential code, like asynchronous code it still requires significant changes to existing code, explicit support in libraries, and does not interoperate well with synchronous code. In other words, it does not solve what&apos;s known as the <a href="http://journal.stuffwithstuff.com/2015/02/01/what-color-is-your-function/" target="_blank">&quot;colored function&quot; problem</a>.</p>
<p>&#x867D;&#x7136;&#x5B9E;&#x73B0; async/await &#x6BD4;&#x6210;&#x719F;&#x7684; continuation &#x548C; Fiber &#x66F4;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x8BE5;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8FDC;&#x8FDC;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002; &#x867D;&#x7136; async/await &#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5E76;&#x8D4B;&#x4E88;&#x5B83;&#x6B63;&#x5E38;&#x3001;&#x987A;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x5C31;&#x50CF;&#x5F02;&#x6B65;&#x4EE3;&#x7801;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5BF9;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x91CD;&#x5927;&#x66F4;&#x6539;&#x3001;&#x5E93;&#x4E2D;&#x7684;&#x663E;&#x5F0F;&#x652F;&#x6301;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x4E0E;&#x540C;&#x6B65;&#x4EE3;&#x7801;&#x5F88;&#x597D;&#x5730;&#x4E92;&#x64CD;&#x4F5C;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#x6240;&#x8C13;&#x7684; <a href="http://journal.stuffwithstuff.com/2015/02/01/what-color-is-your-function/" target="_blank">&quot;colored function&quot; problem</a></p>
<p>&#x8BD1;&#x8005;&#xFF1A;&#x5373;async/await&#x7684;&#x4FB5;&#x5165;&#x6027;&#x95EE;&#x9898;&#x548C;&#x4F20;&#x67D3;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x4EE3;&#x7801;&#x4E0D;&#x517C;&#x5BB9;&#x95EE;&#x9898;</p>
<hr>
<p>1 &#x4EE5;&#x540E;&#x6211;&#x4EEC;&#x79F0;&#x5B83;&#x4E3A; continuation &#x8FD8;&#x662F; coroutine &#x662F;&#x5F85;&#x5B9A;&#x7684;&#x2014;&#x2014;&#x867D;&#x7136;&#x610F;&#x601D;&#x4E0A;&#x6709;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x547D;&#x540D;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x6807;&#x51C6;&#x5316;&#xFF0C;continuation &#x4F3C;&#x4E4E;&#x88AB;&#x7528;&#x4F5C;&#x66F4;&#x901A;&#x7528;&#x7684;&#x672F;&#x8BED;&#x3002;[&#x21A9; .<a href="https://cr.openjdk.java.net/~rpressler/loom/Loom-Proposal.html#ref-footnote-1" target="_blank">&#x21A9;</a></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="【翻译】为什么现代的JVM分析器仍然偏爱安全点？.html" class="navigation navigation-prev " aria-label="Previous page: 为什么现代的jvm仍然偏爱安全点">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="state_of_loom_part1.html" class="navigation navigation-next " aria-label="Next page: State of Loom - Part 1">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Java虚拟机的纤程和计算续体","level":"2.2","depth":1,"next":{"title":"State of Loom - Part 1","level":"2.3","depth":1,"path":"translate/state_of_loom_part1.md","ref":"translate/state_of_loom_part1.md","articles":[]},"previous":{"title":"为什么现代的jvm仍然偏爱安全点","level":"2.1","depth":1,"path":"translate/【翻译】为什么现代的JVM分析器仍然偏爱安全点？.md","ref":"translate/【翻译】为什么现代的JVM分析器仍然偏爱安全点？.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"translate/loom_fiber_continuation.md","mtime":"2024-09-21T16:18:21.172Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2024-09-21T16:18:43.636Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

